{
  "site_name": "DeviceCheck.io",
  "site_tagline": "Herramientas Gratuitas de Prueba de Dispositivos en Línea",
  "home_title": "DeviceCheck.io - Herramientas Gratuitas de Prueba de Dispositivos en Línea",
  "home_description": "Prueba tu webcam, micrófono, teclado, pantalla y más con nuestras herramientas gratuitas de prueba de dispositivos en línea. Diagnósticos instantáneos basados en navegador para Zoom, Teams y Google Meet.",
  "breadcrumb_home": "Inicio",
  "breadcrumb_guides": "Guías",
  "breadcrumb_issues": "Problemas",
  "run_test": "Ejecutar Prueba",
  "run_microphone_test": "Ejecutar Prueba de Micrófono",
  "run_webcam_test": "Ejecutar Prueba de Webcam",
  "run_keyboard_test": "Ejecutar Prueba de Teclado",
  "run_screen_test": "Ejecutar Prueba de Pantalla",
  "mic_test_title": "Prueba de Micrófono en Línea – Herramienta Gratuita de Prueba de Micrófono",
  "mic_test_description": "Prueba tu micrófono en línea al instante. Verifica los niveles de entrada del micrófono, la calidad del audio y reproduce grabaciones con nuestra prueba gratuita de micrófono basada en navegador. Perfecto para Zoom, Teams y Google Meet.",
  "webcam_test_title": "Prueba de Webcam en Línea – Verificación Instantánea de Dispositivo",
  "webcam_problem_h1": "Prueba y repara tu webcam en segundos",
  "keyboard_problem_h1": "Prueba y repara tu teclado en segundos",
  "screen_problem_h1": "Prueba y repara tu pantalla en segundos",
  "meeting_check_problem_h1": "Prueba tu configuración antes de tu próxima llamada",
  "mic_problem_h1": "Prueba y repara tu micrófono en segundos",
  "keyboard_test_title": "Prueba de Teclado en Línea – Herramienta Gratuita de Prueba de Teclado",
  "screen_test_title": "Prueba de Pantalla en Línea – Prueba de Píxeles Muertos y Color",
  "meeting_check_title": "Verificación de Reunión – Herramienta de Preparación para Videollamadas",
  "guides_title": "Guías y Tutoriales de Prueba de Dispositivos",
  "issues_title": "Guías de Solución de Problemas y Correcciones",
  "frequently_asked_questions": "Preguntas Frecuentes",
  "related_tools": "Herramientas Relacionadas",
  "related_guides": "Guías Relacionadas",
  "device_navigation": "Navegación de Dispositivos",
  "microphone_test": "Prueba de Micrófono",
  "webcam_test": "Prueba de Webcam",
  "keyboard_test": "Prueba de Teclado",
  "screen_test": "Prueba de Pantalla",
  "meeting_check": "Verificación de Reunión",
  "privacy": "Privacidad",
  "terms": "Términos",
  "contact": "Contacto",
  "language": "Idioma",
  "english": "English",
  "spanish": "Español",
  "portuguese": "Português",
  "german": "Deutsch",
  "french": "Français",
  "hindi": "हिन्दी",
  "mic_intro": "Prueba tu micrófono al instante con nuestra herramienta gratuita en línea. Verifica los niveles de entrada, comprueba la calidad del audio y asegúrate de que tu micrófono funcione perfectamente antes de videollamadas o grabaciones importantes.",
  "mic_how_to_title": "Cómo Probar Tu Micrófono en Línea",
  "mic_how_to_intro": "Probar tu micrófono antes de una videollamada, grabación de podcast o transmisión en vivo es crucial para una calidad de audio profesional. Nuestra prueba gratuita de micrófono en línea proporciona retroalimentación instantánea sobre la funcionalidad de tu micrófono, niveles de entrada y claridad de audio, todo sin instalar software o crear cuentas.",
  "mic_why_test_title": "¿Por Qué Probar Tu Micrófono?",
  "mic_why_test_intro": "Los problemas del micrófono pueden arruinar llamadas y grabaciones importantes. Al probar de antemano, puedes:",
  "mic_why_test_1": "Verificar que tu micrófono sea detectado y funcione",
  "mic_why_test_2": "Verificar los niveles de volumen de entrada y ajustar si es necesario",
  "mic_why_test_3": "Probar la calidad y claridad del audio",
  "mic_why_test_4": "Asegurar que los permisos del navegador estén configurados correctamente",
  "mic_why_test_5": "Identificar problemas de hardware antes de llamadas importantes",
  "mic_why_test_6": "Probar la salida de altavoces/auriculares para una configuración de audio completa",
  "mic_steps_title": "Guía Paso a Paso para Probar el Micrófono",
  "mic_common_problems_title": "Problemas Comunes del Micrófono y Soluciones",
  "mic_not_working_title": "Micrófono No Funciona o Sin Sonido",
  "mic_not_working_intro": "Si tu micrófono no muestra actividad:",
  "mic_too_quiet_title": "Micrófono Demasiado Bajo o Volumen Bajo",
  "mic_too_quiet_intro": "Si el medidor de volumen muestra poca actividad:",
  "mic_echo_title": "Eco, Retroalimentación o Distorsión",
  "mic_echo_intro": "Los problemas de calidad de audio pueden ser causados por:",
  "mic_wrong_device_title": "Micrófono Incorrecto Seleccionado",
  "mic_wrong_device_intro": "Si se está usando el micrófono incorrecto:",
  "mic_video_conferencing_title": "Probar el Micrófono para Videoconferencias",
  "mic_tips_title": "Consejos para Mejor Calidad de Audio",
  "mic_tips_1": "Usa Auriculares: Previene el eco y la retroalimentación al mantener el audio de los altavoces fuera de tu micrófono",
  "mic_tips_2": "Posiciona Tu Micrófono: Mantén el micrófono a 15-30 cm de tu boca para una claridad óptima",
  "mic_tips_3": "Reduce el Ruido de Fondo: Cierra ventanas, apaga ventiladores y minimiza sonidos ambientales",
  "mic_tips_4": "Habla Claramente: Articula y habla a un volumen consistente",
  "mic_tips_5": "Prueba Antes de Llamadas Importantes: Siempre prueba tu micrófono antes de reuniones o grabaciones importantes",
  "mic_tips_6": "Verifica Tu Entorno: Los muebles suaves reducen el eco; las superficies duras crean reverberación",
  "mic_ready_text": "¿Listo para probar tu micrófono?",
  "mic_scroll_up_text": "Desplázate hacia arriba y haz clic en \"Ejecutar Prueba de Micrófono\"",
  "mic_scroll_up_link": "Desplázate hacia arriba y haz clic en \"Ejecutar Prueba de Micrófono\"",
  "test_another_device": "Probar Otro Dispositivo",
  "mic_step_1_title": "Otorgar Permisos de Micrófono",
  "mic_step_1_text": "Cuando visites nuestra página de prueba de micrófono, tu navegador pedirá acceso al micrófono. Haz clic en \"Permitir\" para continuar. Si no ves una solicitud, busca un icono de micrófono en la barra de direcciones de tu navegador.",
  "mic_step_2_title": "Verificar el Medidor de Volumen",
  "mic_step_2_text": "Una vez otorgados los permisos, habla en tu micrófono. Deberías ver el medidor de volumen responder con barras verdes, amarillas o rojas que indican tu nivel de entrada. Verde/amarillo es ideal; rojo significa que estás demasiado alto.",
  "mic_step_3_title": "Grabar un Clip de Prueba",
  "mic_step_3_text": "Haz clic en el botón del micrófono para grabar una prueba de 5 segundos. Di \"Prueba 1, 2, 3\" o cuenta en voz alta. La grabación se detendrá automáticamente después de 5 segundos.",
  "mic_step_4_title": "Reproducir Tu Grabación",
  "mic_step_4_text": "Después de grabar, haz clic en reproducir para escuchar cómo suenas. Esto ayuda a identificar problemas como eco, distorsión, ruido de fondo o volumen bajo.",
  "mic_step_5_title": "Probar Tus Altavoces",
  "mic_step_5_text": "Usa los botones de prueba de altavoces (Izquierdo, Derecho, Barrido) para verificar que tu dispositivo de salida funciona correctamente y está configurado para audio estéreo.",
  "mic_not_working_1": "Verificar Permisos del Navegador: Haz clic en el icono de candado en la barra de direcciones de tu navegador y asegúrate de que \"Micrófono\" esté configurado en \"Permitir\". En Chrome, ve a Configuración → Privacidad y Seguridad → Configuración del Sitio → Micrófono.",
  "mic_not_working_2": "Verificar Interruptor de Silencio Físico: Muchos auriculares y portátiles tienen botones o interruptores de silencio físicos. Asegúrate de que tu micrófono no esté silenciado físicamente.",
  "mic_not_working_3": "Verificar Dispositivo de Entrada: En Windows, ve a Configuración → Sistema → Sonido → Entrada y asegúrate de que el micrófono correcto esté seleccionado. En Mac, ve a Preferencias del Sistema → Sonido → Entrada.",
  "mic_not_working_4": "Cerrar Otras Aplicaciones: Solo una aplicación puede acceder a tu micrófono a la vez. Cierra Zoom, Teams, Discord u otras aplicaciones que usen el micrófono, luego actualiza esta página.",
  "mic_not_working_5": "Verificar Volumen del Sistema: Asegúrate de que tu micrófono no esté silenciado en la configuración del sistema y que el volumen de entrada esté subido.",
  "mic_too_quiet_1": "Aumentar el volumen de entrada del micrófono en la configuración del sistema (Windows: Configuración → Sonido → Entrada; Mac: Preferencias del Sistema → Sonido → Entrada)",
  "mic_too_quiet_2": "Habilitar el aumento del micrófono si está disponible (Configuración de Sonido de Windows)",
  "mic_too_quiet_3": "Acércate más al micrófono o ajusta la posición",
  "mic_too_quiet_4": "Verifica si tu micrófono tiene un dial o interruptor de control de ganancia",
  "mic_too_quiet_5": "Prueba con un micrófono diferente para descartar problemas de hardware",
  "mic_echo_1": "Retroalimentación de Altavoces: Baja el volumen de los altavoces o usa auriculares para evitar que el micrófono capture la salida de los altavoces",
  "mic_echo_2": "Acústica de la Habitación: Reduce el eco agregando muebles suaves, alfombras o cortinas a tu habitación",
  "mic_echo_3": "Posición del Micrófono: Mantén el micrófono alejado de los altavoces y a una distancia constante de tu boca",
  "mic_echo_4": "Ruido de Fondo: Cierra ventanas, apaga ventiladores y minimiza las fuentes de ruido de fondo",
  "mic_echo_5": "Problemas de Controladores: Actualiza tus controladores de audio (Administrador de Dispositivos de Windows o Preferencias del Sistema de Mac)",
  "mic_wrong_device_1": "Verifica la configuración de sonido del sistema para ver qué dispositivo de entrada está activo",
  "mic_wrong_device_2": "Desconecta y vuelve a conectar los micrófonos USB",
  "mic_wrong_device_3": "En Windows, haz clic derecho en el icono del altavoz → Abrir Configuración de Sonido → Elige tu dispositivo de entrada",
  "mic_wrong_device_4": "En Mac, ve a Preferencias del Sistema → Sonido → Entrada y selecciona el dispositivo correcto",
  "mic_wrong_device_5": "Algunos navegadores te permiten elegir el dispositivo de entrada—verifica la configuración del navegador",
  "mic_zoom_title": "Prueba de Micrófono de Zoom",
  "mic_zoom_text": "Antes de unirte a una reunión de Zoom, prueba tu micrófono aquí primero. Si nuestra herramienta funciona, tu micrófono funcionará en Zoom. También puedes probar en Zoom yendo a Configuración → Audio → Probar Altavoz y Micrófono, pero nuestra prueba del navegador es más rápida y no requiere la aplicación Zoom.",
  "mic_teams_title": "Prueba de Micrófono de Microsoft Teams",
  "mic_teams_text": "Los usuarios de Teams deben probar su micrófono aquí antes de unirse a las reuniones. En Teams, puedes probar yendo a Configuración → Dispositivos → Dispositivos de Audio, pero nuestra prueba en línea funciona desde cualquier navegador sin instalar Teams.",
  "mic_meet_title": "Verificación de Micrófono de Google Meet",
  "mic_meet_text": "Google Meet usa el acceso al micrófono de tu navegador. Si nuestra prueba funciona, Meet también funcionará. También puedes probar en Meet uniéndote a una reunión de prueba y verificando tu configuración de audio antes de que otros se unan.",
  "mic_levels_title": "Entender los Niveles de Entrada del Micrófono",
  "mic_levels_intro": "El medidor de volumen muestra el nivel de entrada de tu micrófono:",
  "mic_levels_green": "Barras Verdes: Nivel de entrada óptimo. Tu voz es clara y a un buen volumen.",
  "mic_levels_yellow": "Barras Amarillas: Buen nivel, pero acercándose al máximo. Aún aceptable para la mayoría de los casos de uso.",
  "mic_levels_red": "Barras Rojas: Demasiado alto—estás recortando o distorsionando. Baja el volumen de entrada o aléjate más del micrófono.",
  "mic_levels_none": "Sin Actividad: Micrófono no detectado, silenciado o volumen demasiado bajo. Verifica permisos y configuración.",
  "mic_permissions_title": "Guía de Permisos de Micrófono del Navegador",
  "mic_permissions_intro": "Cada navegador maneja los permisos del micrófono de manera ligeramente diferente:",
  "mic_permissions_chrome": "Chrome: Haz clic en el icono de candado en la barra de direcciones → Configuración del Sitio → Micrófono → Permitir. O ve a chrome://settings/content/microphone",
  "mic_permissions_firefox": "Firefox: Haz clic en el icono del micrófono en la barra de direcciones → Permitir. O ve a Preferencias → Privacidad y Seguridad → Permisos → Micrófono",
  "mic_permissions_edge": "Edge: Similar a Chrome. Haz clic en el icono de candado → Permisos → Micrófono → Permitir",
  "mic_permissions_safari": "Safari: Safari → Preferencias → Sitios Web → Micrófono → Permitir para este sitio web",
  "mic_privacy_title": "Privacidad y Seguridad",
  "mic_privacy_intro": "Tu privacidad de audio es primordial. Nuestra prueba de micrófono:",
  "mic_privacy_1": "Procesa todos los datos de audio localmente en tu navegador",
  "mic_privacy_2": "No envía audio a nuestros servidores",
  "mic_privacy_3": "No almacena ni graba tu voz",
  "mic_privacy_4": "No comparte datos con terceros",
  "mic_privacy_5": "Detiene el acceso al micrófono cuando cierras la página",
  "mic_privacy_footer": "Todo el procesamiento de audio ocurre en tiempo real en tu dispositivo. Las grabaciones se almacenan temporalmente en la memoria de tu navegador y se eliminan cuando actualizas o cierras la página.",
  "mic_troubleshooting_title": "Guías de Solución de Problemas",
  "mic_faq_1_q": "¿Cómo pruebo mi micrófono en línea?",
  "mic_faq_1_a": "Haz clic en \"Permitir\" cuando se solicite acceso al micrófono. Habla en tu micrófono y observa cómo responde el medidor de volumen. Puedes grabar un clip de prueba de 5 segundos y reproducirlo para verificar la calidad del audio.",
  "mic_faq_2_q": "¿Por qué no funciona mi micrófono?",
  "mic_faq_2_a": "Las causas comunes incluyen permisos del navegador denegados, interruptores de silencio físicos, dispositivo de entrada incorrecto seleccionado o problemas de controladores. Verifica primero los permisos del navegador, luego comprueba la configuración del sistema y asegúrate de que ninguna otra aplicación esté usando el micrófono.",
  "mic_faq_3_q": "¿Puedo probar mi micrófono para Zoom o Teams?",
  "mic_faq_3_a": "¡Sí! Si nuestra prueba de micrófono funciona, tu micrófono funcionará en Zoom, Microsoft Teams, Google Meet y otras plataformas de videoconferencia. Prueba aquí primero para evitar problemas durante llamadas importantes.",
  "mic_faq_4_q": "¿Mis datos de micrófono están seguros?",
  "mic_faq_4_a": "Absolutamente. Todo el procesamiento de audio ocurre localmente en tu navegador. No se envían datos de audio a nuestros servidores, no se graban, almacenan ni comparten con nadie. Tu privacidad está completamente protegida.",
  "mic_faq_5_q": "¿Qué debe mostrar el medidor de volumen?",
  "mic_faq_5_a": "El medidor debe mostrar barras verdes o amarillas cuando hablas normalmente. Si permanece en rojo o no muestra actividad, verifica la configuración de volumen de tu micrófono, asegúrate de que no esté silenciado y comprueba que el dispositivo de entrada correcto esté seleccionado.",
  "webcam_meta_title": "Prueba de Cámara Web en Línea – Verificación Instantánea",
  "webcam_meta_description": "Prueba tu cámara web en línea al instante. Verifica la resolución, velocidad de fotogramas, iluminación y encuadre con nuestra prueba gratuita de cámara web basada en navegador. Perfecto para Zoom, Teams y Google Meet.",
  "webcam_intro": "Prueba tu cámara web al instante con nuestra herramienta gratuita en línea. Verifica la resolución, velocidad de fotogramas, iluminación y perfecciona tu encuadre antes de videollamadas importantes en Zoom, Teams o Google Meet.",
  "webcam_how_title": "Cómo Probar Tu Cámara Web en Línea",
  "webcam_how_intro": "Probar tu cámara web antes de una videollamada o grabación importante es esencial. Nuestra prueba gratuita de cámara web en línea proporciona retroalimentación instantánea sobre la funcionalidad, resolución y calidad de tu cámara, todo sin instalar software.",
  "webcam_why_title": "¿Por Qué Probar Tu Cámara Web en Línea?",
  "webcam_why_intro": "Muchos usuarios descubren problemas con la cámara solo al unirse a una videollamada. Al probar de antemano, puedes:",
  "webcam_why_1": "Verificar que tu cámara sea detectada y funcione correctamente",
  "webcam_why_2": "Comprobar la resolución y velocidad de fotogramas de tu cámara",
  "webcam_why_3": "Asegurar una iluminación y encuadre adecuados",
  "webcam_why_4": "Probar los permisos de la cámara en tu navegador",
  "webcam_why_5": "Identificar problemas de hardware o controladores temprano",
  "webcam_steps_title": "Guía Paso a Paso: Probar Tu Cámara Web",
  "webcam_step_1_title": "Otorgar Permisos de Cámara",
  "webcam_step_1_text": "Cuando visites nuestra página de prueba de cámara web por primera vez, tu navegador te pedirá permitir el acceso a la cámara. Haz clic en \"Permitir\" para continuar. Si no ves una solicitud, busca un icono de cámara en la barra de direcciones de tu navegador y haz clic para habilitar los permisos.",
  "webcam_step_2_title": "Ver Tu Transmisión en Vivo",
  "webcam_step_2_text": "Una vez otorgados los permisos, la transmisión de tu cámara web aparecerá al instante en la ventana de vista previa. Deberías verte en tiempo real.",
  "webcam_step_3_title": "Verificar Resolución",
  "webcam_step_3_text": "Observa la etiqueta de resolución mostrada en la página. Las resoluciones comunes incluyen 720p, 1080p o 4K. Resoluciones más altas proporcionan mejor calidad pero requieren más ancho de banda.",
  "webcam_step_4_title": "Usar Superposición de Cuadrícula",
  "webcam_step_4_text": "Habilita la cuadrícula de regla de tercios y posiciona tus ojos a lo largo de la línea horizontal superior para un encuadre profesional.",
  "webcam_step_5_title": "Alternar Modo Espejo",
  "webcam_step_5_text": "Usa el interruptor de espejo para verte reflejado o no reflejado. Elige lo que se sienta más natural.",
  "webcam_common_title": "Problemas Comunes de Cámara Web y Soluciones",
  "webcam_black_title": "Cámara Web No Funciona o Muestra Pantalla Negra",
  "webcam_black_intro": "Una pantalla negra es uno de los problemas más comunes de cámara web. Soluciona verificando:",
  "webcam_black_1": "Verifica los permisos del navegador (icono de candado) y configura Cámara en Permitir",
  "webcam_black_2": "Cierra otras aplicaciones que usen la cámara (Zoom, Teams, Skype)",
  "webcam_black_3": "Abre cualquier cubierta física de privacidad en la cámara",
  "webcam_black_4": "Reinicia el navegador por completo",
  "webcam_black_5": "Verifica la configuración de cámara del sistema (Windows Privacidad → Cámara; Mac Seguridad y Privacidad → Cámara)",
  "webcam_detect_title": "Cámara Web No Detectada",
  "webcam_detect_intro": "Si tu navegador no detecta tu cámara web:",
  "webcam_detect_1": "Verifica las conexiones USB para cámaras web externas",
  "webcam_detect_2": "Desconecta y vuelve a conectar las cámaras web USB",
  "webcam_detect_3": "Actualiza los controladores de la cámara (Administrador de Dispositivos de Windows o Preferencias del Sistema de Mac)",
  "webcam_detect_4": "Prueba en otro navegador (Chrome, Firefox, Edge, Safari)",
  "webcam_detect_5": "Verifica que la cámara funcione en otra aplicación (aplicación Cámara)",
  "webcam_quality_title": "Calidad de Video Baja o Resolución Baja",
  "webcam_quality_intro": "Si la calidad de tu cámara web parece baja:",
  "webcam_quality_1": "Limpia la lente de la cámara con un paño de microfibra",
  "webcam_quality_2": "Mejora la iluminación: fuente de luz frente a ti, no detrás",
  "webcam_quality_3": "Verifica si hay resoluciones más altas disponibles en la configuración",
  "webcam_quality_4": "Evita cámaras virtuales o filtros que reduzcan la calidad",
  "webcam_quality_5": "Actualiza los controladores de la cámara para mejor rendimiento",
  "webcam_video_conf_title": "Probar Cámara Web para Plataformas de Videoconferencia",
  "webcam_zoom_title": "Prueba de Cámara Web de Zoom",
  "webcam_zoom_text": "Prueba tu cámara web aquí antes de unirte a Zoom. Si funciona aquí, funcionará en Zoom. En Zoom, ve a Configuración → Video para ver una vista previa; nuestra prueba del navegador es más rápida y no requiere la aplicación.",
  "webcam_teams_title": "Prueba de Cámara de Microsoft Teams",
  "webcam_teams_text": "Los usuarios de Teams pueden probar aquí antes de las reuniones. En Teams: Configuración → Dispositivos → Cámara. Nuestra prueba en línea funciona en cualquier navegador sin instalar Teams.",
  "webcam_meet_title": "Verificación de Cámara de Google Meet",
  "webcam_meet_text": "Google Meet depende del acceso a la cámara del navegador. Si nuestra prueba funciona, Meet también funcionará. También puedes unirte a una reunión de prueba y verificar tu vista previa de video antes de que otros se unan.",
  "webcam_resolution_title": "Entender la Resolución de Cámara Web",
  "webcam_resolution_intro": "La resolución de la cámara web determina la claridad y el detalle:",
  "webcam_resolution_1": "480p (640x480): Calidad básica; puede verse pixelada",
  "webcam_resolution_2": "720p HD (1280x720): Estándar para cámaras integradas de portátiles; buena para llamadas",
  "webcam_resolution_3": "1080p Full HD (1920x1080): Común en cámaras web externas; excelente para llamadas profesionales y grabaciones",
  "webcam_resolution_4": "4K UHD (3840x2160): Cámaras web premium; necesita más ancho de banda y procesamiento",
  "webcam_privacy_title": "Privacidad y Seguridad",
  "webcam_privacy_intro": "Tu privacidad es nuestra prioridad. Nuestra prueba de cámara web:",
  "webcam_privacy_1": "Procesa todo el video localmente en tu navegador",
  "webcam_privacy_2": "No graba ni almacena video",
  "webcam_privacy_3": "No envía video a nuestros servidores",
  "webcam_privacy_4": "No comparte tu transmisión con terceros",
  "webcam_privacy_footer": "Todo ocurre en tiempo real en tu dispositivo. Una vez que cierres la página, el acceso a la cámara se detiene inmediatamente.",
  "webcam_browser_title": "Compatibilidad del Navegador",
  "webcam_browser_intro": "Funciona en todos los navegadores modernos que admiten MediaDevices:",
  "webcam_browser_1": "Google Chrome: Soporte completo, recomendado",
  "webcam_browser_2": "Mozilla Firefox: Soporte completo",
  "webcam_browser_3": "Microsoft Edge: Soporte completo",
  "webcam_browser_4": "Apple Safari: Soporte completo en macOS e iOS",
  "webcam_browser_5": "Opera: Soporte completo",
  "webcam_troubleshooting_title": "Guías de Solución de Problemas",
  "webcam_tips_title": "Consejos para Mejores Videollamadas",
  "webcam_tips_1": "Iluminación: coloca tu luz principal frente a ti, no detrás",
  "webcam_tips_2": "Altura de la Cámara: eleva la cámara web a la altura de los ojos para un ángulo favorecedor",
  "webcam_tips_3": "Fondo: manténlo limpio y ordenado",
  "webcam_tips_4": "Contacto Visual: mira la lente de la cámara al hablar",
  "webcam_tips_5": "Encuadrarte: usa la cuadrícula para centrarte y mantener los ojos en el tercio superior",
  "webcam_ready_text": "¿Listo para probar tu cámara web?",
  "webcam_ready_link": "Desplázate hacia arriba y haz clic en \"Ejecutar Prueba de Cámara Web\"",
  "webcam_faq_1_q": "¿Cómo pruebo mi cámara web en línea?",
  "webcam_faq_1_a": "Haz clic en \"Permitir\" cuando se solicite acceso a la cámara. Tu transmisión aparece al instante con detección de resolución y superposición de cuadrícula opcional.",
  "webcam_faq_2_q": "¿Por qué mi cámara web muestra una pantalla negra?",
  "webcam_faq_2_a": "Generalmente son permisos, otra aplicación usando la cámara o una cubierta de privacidad. Permite la cámara, cierra otras aplicaciones y abre la cubierta.",
  "webcam_faq_3_q": "¿Puedo probar mi cámara web para Zoom o Teams?",
  "webcam_faq_3_a": "Sí. Si funciona aquí, funcionará en Zoom, Teams, Meet y otras plataformas.",
  "webcam_faq_4_q": "¿Qué resolución de cámara web debo usar?",
  "webcam_faq_4_a": "720p es suficiente para la mayoría de las llamadas. Usa 1080p o 4K para mayor calidad si el ancho de banda lo permite.",
  "webcam_faq_5_q": "¿Mis datos de cámara web están seguros?",
  "webcam_faq_5_a": "Todo el video permanece en tu navegador. No enviamos, almacenamos ni compartimos tu transmisión de cámara.",
  "keyboard_meta_title": "Online Keyboard Test – Free Key Tester",
  "keyboard_meta_description": "Test your keyboard online instantly. Check all keys, detect stuck keys, test ghosting, and verify functionality with our free browser-based keyboard test.",
  "keyboard_intro": "Test your keyboard instantly with our free online tool. Check if all keys work properly, detect stuck or non-responsive keys, test for ghosting, and verify your keyboard functionality.",
  "keyboard_how_title": "How to Test Your Keyboard Online",
  "keyboard_how_intro": "Testing your keyboard is essential for ensuring all keys work correctly, especially before important work or gaming sessions. Our free online keyboard test provides instant visual feedback on every key press—all without installing software.",
  "keyboard_why_title": "Why Test Your Keyboard?",
  "keyboard_why_intro": "Keyboard issues can disrupt productivity and gaming. By testing, you can:",
  "keyboard_why_1": "Verify all keys register correctly",
  "keyboard_why_2": "Identify stuck or sticky keys",
  "keyboard_why_3": "Test for keyboard ghosting (multiple key presses)",
  "keyboard_why_4": "Check modifier keys (Shift, Ctrl, Alt) functionality",
  "keyboard_why_5": "Verify special keys (Function keys, arrow keys, etc.)",
  "keyboard_why_6": "Test before important work or gaming",
  "keyboard_steps_title": "Step-by-Step Keyboard Testing Guide",
  "keyboard_step_1_title": "Start Testing",
  "keyboard_step_1_text": "Click \"Run Keyboard Test\" or start pressing keys. Each key lights green when pressed and blue after being tested.",
  "keyboard_step_2_title": "Test All Keys",
  "keyboard_step_2_text": "Press every key including letters, numbers, symbols, function keys, and modifiers (Shift, Ctrl, Alt, etc.).",
  "keyboard_step_3_title": "Check Progress",
  "keyboard_step_3_text": "Watch the progress bar to see how many keys you’ve tested. Aim to test all keys on your keyboard.",
  "keyboard_step_4_title": "Test Multiple Keys",
  "keyboard_step_4_text": "Press multiple keys simultaneously to test for ghosting. Missing registrations indicate ghosting issues.",
  "keyboard_step_5_title": "Review Results",
  "keyboard_step_5_text": "Check recent key presses. If a key doesn’t appear, it may be faulty.",
  "keyboard_common_title": "Common Keyboard Problems and Solutions",
  "keyboard_stuck_title": "Stuck Keys or Keys That Don't Release",
  "keyboard_stuck_intro": "If a key stays pressed or doesn’t release:",
  "keyboard_stuck_1": "Physical debris: use compressed air to clear crumbs/dust/liquid.",
  "keyboard_stuck_2": "Liquid spills: unplug, invert, dry 24-48h; remove keycaps for cleaning if possible.",
  "keyboard_stuck_3": "Keycap removal: gently remove and clean underneath; avoid damaging mechanism.",
  "keyboard_stuck_4": "Mechanical issues: switches may be damaged; replace switch or keyboard if multiple keys affected.",
  "keyboard_not_working_title": "Keys Not Working or Not Registering",
  "keyboard_not_working_intro": "If keys don’t register:",
  "keyboard_not_working_1": "Connection issues: replug USB; for wireless, check battery and reconnect.",
  "keyboard_not_working_2": "Driver problems: update keyboard drivers (Windows Device Manager / Mac System Preferences).",
  "keyboard_not_working_3": "Test on another computer: if it works elsewhere, issue is software; if not, hardware failure.",
  "keyboard_not_working_4": "Check for physical damage: broken switches or loose connections.",
  "keyboard_not_working_5": "Software conflicts: close remapping/macro tools that may block input.",
  "keyboard_ghosting_title": "Keyboard Ghosting",
  "keyboard_ghosting_intro": "Ghosting occurs when multiple simultaneous presses fail to register, common on non-NKRO keyboards:",
  "keyboard_ghosting_1": "Cause: matrix design without N-key rollover; cheaper boards lack NKRO/6KRO.",
  "keyboard_ghosting_2": "How to test: press combos (e.g., WASD + Shift + Space); missing keys indicate ghosting.",
  "keyboard_ghosting_3": "Solutions: upgrade to NKRO/6KRO (mechanical boards often support NKRO via USB/PS2).",
  "keyboard_ghosting_4": "Gaming impact: ghosting hurts gamers needing multiple simultaneous presses; test common combos.",
  "keyboard_wrong_title": "Wrong Characters Appearing",
  "keyboard_wrong_intro": "If a key outputs the wrong character:",
  "keyboard_wrong_1": "Check keyboard layout (QWERTY/AZERTY/QWERTZ).",
  "keyboard_wrong_2": "Verify OS language/region settings.",
  "keyboard_wrong_3": "Check stuck modifiers (Shift/Alt/Ctrl).",
  "keyboard_wrong_4": "Restart to reset keyboard state.",
  "keyboard_wrong_5": "Use on-screen keyboard to isolate software vs hardware.",
  "keyboard_types_title": "Understanding Keyboard Types",
  "keyboard_mech_title": "Mechanical Keyboards",
  "keyboard_mech_intro": "Mechanical keyboards use individual switches, offering:",
  "keyboard_mech_1": "Better tactile feedback and feel",
  "keyboard_mech_2": "Longer lifespan (50-100M keystrokes)",
  "keyboard_mech_3": "Often support N-key rollover (NKRO)",
  "keyboard_mech_4": "Customizable keycaps and switches",
  "keyboard_mech_5": "Generally more expensive",
  "keyboard_mem_title": "Membrane Keyboards",
  "keyboard_mem_intro": "Membrane keyboards use rubber domes, offering:",
  "keyboard_mem_1": "Quieter operation",
  "keyboard_mem_2": "Lower cost",
  "keyboard_mem_3": "Thinner profile",
  "keyboard_mem_4": "May have ghosting with multiple presses",
  "keyboard_mem_5": "Shorter lifespan vs mechanical",
  "keyboard_laptop_title": "Laptop Keyboards",
  "keyboard_laptop_intro": "Laptop keyboards are integrated and compact:",
  "keyboard_laptop_1": "Compact with function key combos",
  "keyboard_laptop_2": "Limited key travel",
  "keyboard_laptop_3": "Hard to repair/replace individual keys",
  "keyboard_laptop_4": "Layout variations (Enter size, arrows, etc.)",
  "keyboard_maint_title": "Keyboard Maintenance Tips",
  "keyboard_maint_1": "Regular cleaning: compressed air monthly to remove dust/debris",
  "keyboard_maint_2": "Avoid eating over keyboard: crumbs/spills cause failures",
  "keyboard_maint_3": "Clean keycaps: remove (if possible), wash, dry fully before reattaching",
  "keyboard_maint_4": "Update drivers: keep keyboard drivers current",
  "keyboard_maint_5": "Protect from spills: use covers or keep drinks away",
  "keyboard_maint_6": "Test regularly: run keyboard test monthly to catch issues early",
  "keyboard_troubleshooting_title": "Troubleshooting Guides",
  "keyboard_tips_gaming_title": "Testing for Gaming",
  "keyboard_tips_gaming_intro": "Gamers need reliable multi-key input. When testing for gaming:",
  "keyboard_tips_gaming_1": "Test common gaming combos (WASD + Shift + Space + Ctrl)",
  "keyboard_tips_gaming_2": "Verify all movement keys",
  "keyboard_tips_gaming_3": "Check modifiers used in games",
  "keyboard_tips_gaming_4": "Test for ghosting with simultaneous presses",
  "keyboard_tips_gaming_5": "Ensure fast registration without delay",
  "keyboard_tips_gaming_6": "Consider anti-ghosting or NKRO boards for competitive play",
  "keyboard_ready_text": "Ready to test your keyboard?",
  "keyboard_ready_link": "Scroll up and click \"Run Keyboard Test\"",
  "keyboard_faq_1_q": "How do I test my keyboard online?",
  "keyboard_faq_1_a": "Press any key; tested keys light up. Progress shows which keys you’ve checked.",
  "keyboard_faq_2_q": "What is keyboard ghosting?",
  "keyboard_faq_2_a": "Ghosting is missed keys when pressing multiple keys. It happens on non-NKRO keyboards; test combos to confirm.",
  "keyboard_faq_3_q": "How do I fix stuck keys?",
  "keyboard_faq_3_a": "Clean debris, remove keycaps carefully, dry after spills, or replace switches/keyboard if needed.",
  "keyboard_faq_4_q": "Why are some keys not working?",
  "keyboard_faq_4_a": "Could be damage, debris, drivers, or hardware failure. Clean, update drivers, and test on another computer.",
  "keyboard_faq_5_q": "Can I test laptop keyboards?",
  "keyboard_faq_5_a": "Yes. Works for laptop, mechanical, membrane, and wireless keyboards—just press keys to test."
}



