{
  "site_name": "DeviceCheck.io",
  "site_tagline": "Outils Gratuits de Test de Dispositifs en Ligne",
  "home_title": "DeviceCheck.io - Outils Gratuits de Test de Dispositifs en Ligne",
  "home_description": "Testez votre webcam, microphone, clavier, écran et plus encore avec nos outils gratuits de test de dispositifs en ligne. Diagnostics instantanés basés sur le navigateur pour Zoom, Teams et Google Meet.",
  "breadcrumb_home": "Accueil",
  "breadcrumb_guides": "Guides",
  "breadcrumb_issues": "Problèmes",
  "run_test": "Lancer le Test",
  "run_microphone_test": "Lancer le Test de Microphone",
  "run_webcam_test": "Lancer le Test de Webcam",
  "run_keyboard_test": "Lancer le Test de Clavier",
  "run_screen_test": "Lancer le Test d'Écran",
  "mic_test_title": "Test de Microphone en Ligne – Outil Gratuit de Test de Microphone",
  "mic_test_description": "Testez votre microphone en ligne instantanément. Vérifiez les niveaux d'entrée du microphone, la qualité audio et la lecture d'enregistrements avec notre test de microphone gratuit basé sur le navigateur. Parfait pour Zoom, Teams et Google Meet.",
  "webcam_test_title": "Test de Webcam en Ligne – Vérification Instantanée de Dispositif",
  "webcam_problem_h1": "Testez et réparez votre webcam en quelques secondes",
  "keyboard_problem_h1": "Testez et réparez votre clavier en quelques secondes",
  "screen_problem_h1": "Testez et réparez votre écran en quelques secondes",
  "meeting_check_problem_h1": "Testez votre configuration avant votre prochain appel",
  "mic_problem_h1": "Testez et réparez votre micro en quelques secondes",
  "keyboard_test_title": "Test de Clavier en Ligne – Outil Gratuit de Test de Clavier",
  "screen_test_title": "Test d'Écran en Ligne – Test de Pixel Mort et de Couleur",
  "meeting_check_title": "Vérification de Réunion – Outil de Préparation aux Appels Vidéo",
  "guides_title": "Guides et Tutoriels de Test de Dispositifs",
  "issues_title": "Guides de Dépannage et Solutions",
  "frequently_asked_questions": "Questions Fréquemment Posées",
  "related_tools": "Outils Connexes",
  "related_guides": "Guides Connexes",
  "device_navigation": "Navigation des Dispositifs",
  "microphone_test": "Test de Microphone",
  "webcam_test": "Test de Webcam",
  "keyboard_test": "Test de Clavier",
  "screen_test": "Test d'Écran",
  "meeting_check": "Vérification de Réunion",
  "privacy": "Confidentialité",
  "terms": "Conditions",
  "contact": "Contact",
  "language": "Langue",
  "english": "English",
  "spanish": "Español",
  "portuguese": "Português",
  "german": "Deutsch",
  "french": "Français",
  "hindi": "हिन्दी",
  "mic_intro": "Testez votre microphone instantanément avec notre outil gratuit en ligne. Vérifiez les niveaux d'entrée, vérifiez la qualité audio et assurez-vous que votre microphone fonctionne parfaitement avant les appels vidéo ou enregistrements importants.",
  "mic_how_to_title": "Comment Tester Votre Microphone en Ligne",
  "mic_how_to_intro": "Tester votre microphone avant un appel vidéo, un enregistrement de podcast ou une diffusion en direct est crucial pour une qualité audio professionnelle. Notre test de microphone gratuit en ligne fournit un retour instantané sur la fonctionnalité de votre microphone, les niveaux d'entrée et la clarté audio, le tout sans installer de logiciel ou créer de compte.",
  "mic_why_test_title": "Pourquoi Tester Votre Microphone?",
  "mic_why_test_intro": "Les problèmes de microphone peuvent ruiner les appels et enregistrements importants. En testant à l'avance, vous pouvez:",
  "mic_why_test_1": "Vérifier que votre microphone est détecté et fonctionne",
  "mic_why_test_2": "Vérifier les niveaux de volume d'entrée et ajuster si nécessaire",
  "mic_why_test_3": "Tester la qualité et la clarté audio",
  "mic_why_test_4": "S'assurer que les permissions du navigateur sont correctement configurées",
  "mic_why_test_5": "Identifier les problèmes matériels avant les appels importants",
  "mic_why_test_6": "Tester la sortie haut-parleurs/casque pour une configuration audio complète",
  "mic_steps_title": "Guide Étape par Étape pour Tester le Microphone",
  "mic_common_problems_title": "Problèmes Courants du Microphone et Solutions",
  "mic_not_working_title": "Microphone Ne Fonctionne Pas ou Pas de Son",
  "mic_not_working_intro": "Si votre microphone ne montre aucune activité:",
  "mic_too_quiet_title": "Microphone Trop Faible ou Volume Bas",
  "mic_too_quiet_intro": "Si le compteur de volume montre une faible activité:",
  "mic_echo_title": "Écho, Retour ou Distorsion",
  "mic_echo_intro": "Les problèmes de qualité audio peuvent être causés par:",
  "mic_wrong_device_title": "Mauvais Microphone Sélectionné",
  "mic_wrong_device_intro": "Si le mauvais microphone est utilisé:",
  "mic_video_conferencing_title": "Tester le Microphone pour les Vidéoconférences",
  "mic_tips_title": "Conseils pour une Meilleure Qualité Audio",
  "mic_tips_1": "Utilisez des Écouteurs: Empêche l'écho et le retour en gardant l'audio des haut-parleurs hors de votre microphone",
  "mic_tips_2": "Positionnez Votre Microphone: Gardez le microphone à 15-30 cm de votre bouche pour une clarté optimale",
  "mic_tips_3": "Réduisez le Bruit de Fond: Fermez les fenêtres, éteignez les ventilateurs et minimisez les sons ambiants",
  "mic_tips_4": "Parlez Clairement: Articulez et parlez à un volume constant",
  "mic_tips_5": "Testez Avant les Appels Importants: Testez toujours votre microphone avant les réunions ou enregistrements importants",
  "mic_tips_6": "Vérifiez Votre Environnement: Les meubles mous réduisent l'écho; les surfaces dures créent de la réverbération",
  "mic_ready_text": "Prêt à tester votre microphone?",
  "mic_scroll_up_text": "Faites défiler vers le haut et cliquez sur \"Lancer le Test de Microphone\"",
  "mic_scroll_up_link": "Faites défiler vers le haut et cliquez sur \"Lancer le Test de Microphone\"",
  "test_another_device": "Tester un Autre Dispositif",
  "mic_step_1_title": "Accorder les autorisations microphone",
  "mic_step_1_text": "Lorsque vous visitez notre page de test de microphone, votre navigateur demande l'accès. Cliquez sur « Autoriser » pour continuer. Si vous ne voyez pas la demande, cherchez l'icône microphone dans la barre d'adresse.",
  "mic_step_2_title": "Vérifier le vumètre",
  "mic_step_2_text": "Une fois les permissions accordées, parlez dans votre micro. Le vumètre doit réagir en vert, jaune ou rouge. Vert/jaune est idéal ; rouge signifie trop fort.",
  "mic_step_3_title": "Enregistrer un clip de test",
  "mic_step_3_text": "Cliquez sur le bouton micro pour enregistrer 5 secondes. Dites « Test 1, 2, 3 » ou comptez à voix haute. L'enregistrement s'arrête automatiquement.",
  "mic_step_4_title": "Écouter l'enregistrement",
  "mic_step_4_text": "Après l'enregistrement, cliquez sur lecture pour entendre le rendu. Utile pour détecter écho, distorsion, bruit de fond ou faible volume.",
  "mic_step_5_title": "Tester vos haut-parleurs",
  "mic_step_5_text": "Utilisez les boutons de test (Gauche, Droite, Balayage) pour vérifier que votre sortie fonctionne bien et est configurée en stéréo.",
  "mic_not_working_1": "Vérifier les permissions du navigateur : cliquez sur l'icône cadenas dans la barre d'adresse et mettez « Microphone » sur « Autoriser ». Chrome : Paramètres → Confidentialité et sécurité → Paramètres des sites → Microphone.",
  "mic_not_working_2": "Vérifier l'interrupteur muet physique : de nombreux casques/PC portables ont un bouton de sourdine. Assurez-vous que le micro n'est pas coupé.",
  "mic_not_working_3": "Vérifier le périphérique d'entrée : Windows : Paramètres → Système → Son → Entrée. Mac : Réglages Système → Son → Entrée.",
  "mic_not_working_4": "Fermer les autres applications : une seule application peut accéder au micro. Fermez Zoom, Teams, Discord, etc., puis rafraîchissez.",
  "mic_not_working_5": "Vérifier le volume système : assurez-vous que le micro n'est pas en sourdine et que le volume d'entrée est suffisant.",
  "mic_too_quiet_1": "Augmenter le volume d'entrée du micro dans les réglages système (Windows : Paramètres → Son → Entrée ; Mac : Réglages Système → Son → Entrée)",
  "mic_too_quiet_2": "Activer le gain du micro si disponible (Paramètres Son Windows)",
  "mic_too_quiet_3": "Se rapprocher du micro ou ajuster la position",
  "mic_too_quiet_4": "Vérifier si votre micro a un réglage de gain",
  "mic_too_quiet_5": "Tester avec un autre micro pour exclure un problème matériel",
  "mic_echo_1": "Larsen des haut-parleurs : baissez le volume ou utilisez un casque pour éviter que le micro capte la sortie",
  "mic_echo_2": "Acoustique de la pièce : réduisez l'écho avec des tissus, tapis ou rideaux",
  "mic_echo_3": "Position du micro : gardez-le éloigné des haut-parleurs et à distance constante de la bouche",
  "mic_echo_4": "Bruit de fond : fermez fenêtres, éteignez ventilateurs et minimisez les sources sonores",
  "mic_echo_5": "Problèmes de pilote : mettez à jour vos pilotes audio (Gestionnaire de périphériques Windows ou Réglages Système Mac)",
  "mic_wrong_device_1": "Vérifiez dans les réglages son système quel périphérique d'entrée est actif",
  "mic_wrong_device_2": "Débranchez et rebranchez les micros USB",
  "mic_wrong_device_3": "Windows : clic droit sur l'icône haut-parleur → Ouvrir les paramètres son → Choisir l'entrée",
  "mic_wrong_device_4": "Mac : Réglages Système → Son → Entrée, sélectionnez le bon appareil",
  "mic_wrong_device_5": "Certains navigateurs permettent de choisir l'entrée — vérifiez leurs paramètres",
  "mic_zoom_title": "Test de microphone Zoom",
  "mic_zoom_text": "Avant une réunion Zoom, testez ici. Si l'outil fonctionne, Zoom fonctionnera aussi. Dans Zoom : Paramètres → Audio → Tester haut-parleur et micro ; notre test navigateur est plus rapide et sans appli.",
  "mic_teams_title": "Test micro Microsoft Teams",
  "mic_teams_text": "Les utilisateurs Teams doivent tester ici avant les réunions. Dans Teams : Paramètres → Appareils → Appareils audio ; notre test en ligne marche sur tout navigateur sans installation.",
  "mic_meet_title": "Vérification microphone Google Meet",
  "mic_meet_text": "Google Meet utilise l'accès micro du navigateur. Si notre test marche, Meet aussi. Vous pouvez aussi rejoindre une réunion test et vérifier l'audio avant les autres.",
  "mic_levels_title": "Comprendre les niveaux d'entrée du micro",
  "mic_levels_intro": "Le vumètre indique le niveau d'entrée du microphone :",
  "mic_levels_green": "Barres vertes : niveau optimal. Voix claire et bon volume.",
  "mic_levels_yellow": "Barres jaunes : bon niveau, proche du max. Généralement acceptable.",
  "mic_levels_red": "Barres rouges : trop fort — saturation/distorsion. Baissez le volume ou éloignez le micro.",
  "mic_levels_none": "Aucune activité : micro non détecté, coupé ou volume trop bas. Vérifiez permissions et réglages.",
  "mic_permissions_title": "Guide des permissions micro du navigateur",
  "mic_permissions_intro": "Chaque navigateur gère les permissions micro un peu différemment :",
  "mic_permissions_chrome": "Chrome : icône cadenas → Paramètres du site → Microphone → Autoriser. Ou chrome://settings/content/microphone",
  "mic_permissions_firefox": "Firefox : icône micro dans la barre d'adresse → Autoriser. Ou Préférences → Vie privée et sécurité → Permissions → Microphone",
  "mic_permissions_edge": "Edge : comme Chrome. Icône cadenas → Permissions → Microphone → Autoriser",
  "mic_permissions_safari": "Safari : Safari → Préférences → Sites web → Microphone → Autoriser pour ce site",
  "mic_privacy_title": "Confidentialité et sécurité",
  "mic_privacy_intro": "Votre vie privée audio est essentielle. Notre test de micro :",
  "mic_privacy_1": "Traite toutes les données audio localement dans votre navigateur",
  "mic_privacy_2": "N’envoie pas l’audio à nos serveurs",
  "mic_privacy_3": "Ne stocke ni n’enregistre votre voix",
  "mic_privacy_4": "Ne partage pas de données avec des tiers",
  "mic_privacy_5": "Arrête l'accès micro quand vous fermez la page",
  "mic_privacy_footer": "Tout traitement audio est en temps réel sur votre appareil. Les enregistrements sont temporaires en mémoire navigateur et supprimés au rafraîchissement/fermeture.",
  "mic_troubleshooting_title": "Guides de dépannage",
  "mic_faq_1_q": "How do I test my microphone online?",
  "mic_faq_1_a": "Click \"Allow\" when prompted for microphone access. Speak into your mic and watch the volume meter respond. You can record a 5-second test clip and play it back to verify audio quality.",
  "mic_faq_2_q": "Why is my microphone not working?",
  "mic_faq_2_a": "Common causes include denied browser permissions, physical mute switches, wrong input device selected, or driver issues. Check browser permissions first, then verify system settings and ensure no other apps are using the microphone.",
  "mic_faq_3_q": "Can I test my microphone for Zoom or Teams?",
  "mic_faq_3_a": "Yes! If our microphone test works, your mic will work in Zoom, Microsoft Teams, Google Meet, and other video conferencing platforms. Test here first to avoid issues during important calls.",
  "mic_faq_4_q": "Is my microphone data secure?",
  "mic_faq_4_a": "Absolutely. All audio processing happens locally in your browser. No audio data is sent to our servers, recorded, stored, or shared with anyone. Your privacy is completely protected.",
  "mic_faq_5_q": "What should the volume meter show?",
  "mic_faq_5_a": "The meter should show green/yellow bars when you speak normally. If it stays red or shows no activity, check your mic volume settings, ensure you're not muted, and verify the correct input device is selected.",
  "webcam_meta_title": "Online Webcam Test – Instant Camera Check",
  "webcam_meta_description": "Test your webcam online instantly. Check camera resolution, frame rate, lighting, and framing with our free browser-based webcam test. Perfect for Zoom, Teams, and Google Meet.",
  "webcam_intro": "Test your webcam instantly with our free online tool. Check resolution, frame rate, lighting, and perfect your framing before important video calls on Zoom, Teams, or Google Meet.",
  "webcam_how_title": "How to Test Your Webcam Online",
  "webcam_how_intro": "Testing your webcam before an important video call or recording is essential. Our free online webcam test provides instant feedback on your camera's functionality, resolution, and quality—all without installing any software.",
  "webcam_why_title": "Why Test Your Webcam Online?",
  "webcam_why_intro": "Many users discover camera issues only when joining a video call. By testing beforehand, you can:",
  "webcam_why_1": "Verify your camera is detected and working correctly",
  "webcam_why_2": "Check your camera's resolution and frame rate",
  "webcam_why_3": "Ensure proper lighting and framing",
  "webcam_why_4": "Test camera permissions in your browser",
  "webcam_why_5": "Identify hardware or driver issues early",
  "webcam_steps_title": "Step-by-Step Guide: Testing Your Webcam",
  "webcam_step_1_title": "Grant Camera Permissions",
  "webcam_step_1_text": "When you first visit our webcam test page, your browser will prompt you to allow camera access. Click \"Allow\" to proceed. If you don't see a prompt, check your browser's address bar for a camera icon and click it to enable permissions.",
  "webcam_step_2_title": "View Your Live Feed",
  "webcam_step_2_text": "Once permissions are granted, your webcam feed will appear instantly in the preview window. You should see yourself in real-time.",
  "webcam_step_3_title": "Check Resolution",
  "webcam_step_3_text": "Look at the resolution badge displayed on the page. Common resolutions include 720p, 1080p, or 4K. Higher resolutions provide better quality but require more bandwidth.",
  "webcam_step_4_title": "Use Grid Overlay",
  "webcam_step_4_text": "Enable the rule-of-thirds grid and position your eyes along the top horizontal line for professional framing.",
  "webcam_step_5_title": "Toggle Mirror Mode",
  "webcam_step_5_text": "Use the mirror toggle to see yourself mirrored or unmirrored. Choose what feels most natural.",
  "webcam_common_title": "Common Webcam Issues and Solutions",
  "webcam_black_title": "Webcam Not Working or Showing Black Screen",
  "webcam_black_intro": "A black screen is one of the most common webcam issues. Troubleshoot by:",
  "webcam_black_1": "Check browser permissions (lock icon) and set Camera to Allow",
  "webcam_black_2": "Close other applications using the camera (Zoom, Teams, Skype)",
  "webcam_black_3": "Open any physical privacy cover on the camera",
  "webcam_black_4": "Restart the browser completely",
  "webcam_black_5": "Check system camera settings (Windows Privacy → Camera; Mac Security & Privacy → Camera)",
  "webcam_detect_title": "Webcam Not Detected",
  "webcam_detect_intro": "If your browser doesn't detect your webcam:",
  "webcam_detect_1": "Check USB connections for external webcams",
  "webcam_detect_2": "Unplug and replug USB webcams",
  "webcam_detect_3": "Update camera drivers (Windows Device Manager or Mac System Preferences)",
  "webcam_detect_4": "Test in another browser (Chrome, Firefox, Edge, Safari)",
  "webcam_detect_5": "Verify the camera works in another app (Camera app)",
  "webcam_quality_title": "Poor Video Quality or Low Resolution",
  "webcam_quality_intro": "If your webcam quality seems low:",
  "webcam_quality_1": "Clean the camera lens with a microfiber cloth",
  "webcam_quality_2": "Improve lighting—light source in front of you, not behind",
  "webcam_quality_3": "Check if higher resolutions are available in settings",
  "webcam_quality_4": "Avoid virtual cameras/filters that reduce quality",
  "webcam_quality_5": "Update camera drivers for better performance",
  "webcam_video_conf_title": "Testing Webcam for Video Conferencing Platforms",
  "webcam_zoom_title": "Zoom Webcam Test",
  "webcam_zoom_text": "Test your webcam here before joining Zoom. If it works here, it will work in Zoom. In Zoom, go to Settings → Video to see a preview; our browser test is faster and requires no app.",
  "webcam_teams_title": "Microsoft Teams Camera Test",
  "webcam_teams_text": "Teams users can test here before meetings. In Teams: Settings → Devices → Camera. Our online test works in any browser without installing Teams.",
  "webcam_meet_title": "Google Meet Camera Check",
  "webcam_meet_text": "Google Meet relies on browser camera access. If our test works, Meet will too. You can also join a test meeting and check your video preview before others join.",
  "webcam_resolution_title": "Understanding Webcam Resolution",
  "webcam_resolution_intro": "Webcam resolution determines clarity and detail:",
  "webcam_resolution_1": "480p (640x480): Basic quality; can look pixelated",
  "webcam_resolution_2": "720p HD (1280x720): Standard for built-in laptop cameras; good for calls",
  "webcam_resolution_3": "1080p Full HD (1920x1080): Common in external webcams; great for professional calls and recordings",
  "webcam_resolution_4": "4K UHD (3840x2160): Premium webcams; needs more bandwidth/processing",
  "webcam_privacy_title": "Privacy and Security",
  "webcam_privacy_intro": "Your privacy is our priority. Our webcam test:",
  "webcam_privacy_1": "Processes all video locally in your browser",
  "webcam_privacy_2": "Does not record or store video",
  "webcam_privacy_3": "Does not send video to our servers",
  "webcam_privacy_4": "Does not share your feed with third parties",
  "webcam_privacy_footer": "Everything happens in real-time on your device. Once you close the page, camera access stops immediately.",
  "webcam_browser_title": "Browser Compatibility",
  "webcam_browser_intro": "Works on all modern browsers that support MediaDevices:",
  "webcam_browser_1": "Google Chrome: Full support, recommended",
  "webcam_browser_2": "Mozilla Firefox: Full support",
  "webcam_browser_3": "Microsoft Edge: Full support",
  "webcam_browser_4": "Apple Safari: Full support on macOS and iOS",
  "webcam_browser_5": "Opera: Full support",
  "webcam_troubleshooting_title": "Troubleshooting Guides",
  "webcam_tips_title": "Tips for Better Video Calls",
  "webcam_tips_1": "Lighting: place your main light in front of you, not behind",
  "webcam_tips_2": "Camera Height: raise the webcam to eye level for a flattering angle",
  "webcam_tips_3": "Background: keep it clean and uncluttered",
  "webcam_tips_4": "Eye Contact: look at the camera lens when speaking",
  "webcam_tips_5": "Frame Yourself: use the grid to center and keep eyes on the top third",
  "webcam_ready_text": "Ready to test your webcam?",
  "webcam_ready_link": "Scroll up and click \"Run Webcam Test\"",
  "webcam_faq_1_q": "How do I test my webcam online?",
  "webcam_faq_1_a": "Click \"Allow\" when prompted for camera access. Your feed appears instantly with resolution detection and optional grid overlay.",
  "webcam_faq_2_q": "Why is my webcam showing a black screen?",
  "webcam_faq_2_a": "Usually permissions, another app using the camera, or a privacy cover. Allow camera, close other apps, and open the cover.",
  "webcam_faq_3_q": "Can I test my webcam for Zoom or Teams?",
  "webcam_faq_3_a": "Yes. If it works here, it works in Zoom, Teams, Meet, and other platforms.",
  "webcam_faq_4_q": "What webcam resolution should I use?",
  "webcam_faq_4_a": "720p is enough for most calls. Use 1080p or 4K for higher quality if bandwidth allows.",
  "webcam_faq_5_q": "Is my webcam data secure?",
  "webcam_faq_5_a": "All video stays in your browser. We do not send, store, or share your camera feed.",
  "keyboard_meta_title": "Online Keyboard Test – Free Key Tester",
  "keyboard_meta_description": "Test your keyboard online instantly. Check all keys, detect stuck keys, test ghosting, and verify functionality with our free browser-based keyboard test.",
  "keyboard_intro": "Test your keyboard instantly with our free online tool. Check if all keys work properly, detect stuck or non-responsive keys, test for ghosting, and verify your keyboard functionality.",
  "keyboard_how_title": "How to Test Your Keyboard Online",
  "keyboard_how_intro": "Testing your keyboard is essential for ensuring all keys work correctly, especially before important work or gaming sessions. Our free online keyboard test provides instant visual feedback on every key press—all without installing software.",
  "keyboard_why_title": "Why Test Your Keyboard?",
  "keyboard_why_intro": "Keyboard issues can disrupt productivity and gaming. By testing, you can:",
  "keyboard_why_1": "Verify all keys register correctly",
  "keyboard_why_2": "Identify stuck or sticky keys",
  "keyboard_why_3": "Test for keyboard ghosting (multiple key presses)",
  "keyboard_why_4": "Check modifier keys (Shift, Ctrl, Alt) functionality",
  "keyboard_why_5": "Verify special keys (Function keys, arrow keys, etc.)",
  "keyboard_why_6": "Test before important work or gaming",
  "keyboard_steps_title": "Step-by-Step Keyboard Testing Guide",
  "keyboard_step_1_title": "Start Testing",
  "keyboard_step_1_text": "Click \"Run Keyboard Test\" or start pressing keys. Each key lights green when pressed and blue after being tested.",
  "keyboard_step_2_title": "Test All Keys",
  "keyboard_step_2_text": "Press every key including letters, numbers, symbols, function keys, and modifiers (Shift, Ctrl, Alt, etc.).",
  "keyboard_step_3_title": "Check Progress",
  "keyboard_step_3_text": "Watch the progress bar to see how many keys you’ve tested. Aim to test all keys on your keyboard.",
  "keyboard_step_4_title": "Test Multiple Keys",
  "keyboard_step_4_text": "Press multiple keys simultaneously to test for ghosting. Missing registrations indicate ghosting issues.",
  "keyboard_step_5_title": "Review Results",
  "keyboard_step_5_text": "Check recent key presses. If a key doesn’t appear, it may be faulty.",
  "keyboard_common_title": "Common Keyboard Problems and Solutions",
  "keyboard_stuck_title": "Stuck Keys or Keys That Don't Release",
  "keyboard_stuck_intro": "If a key stays pressed or doesn’t release:",
  "keyboard_stuck_1": "Physical debris: use compressed air to clear crumbs/dust/liquid.",
  "keyboard_stuck_2": "Liquid spills: unplug, invert, dry 24-48h; remove keycaps for cleaning if possible.",
  "keyboard_stuck_3": "Keycap removal: gently remove and clean underneath; avoid damaging mechanism.",
  "keyboard_stuck_4": "Mechanical issues: switches may be damaged; replace switch or keyboard if multiple keys affected.",
  "keyboard_not_working_title": "Keys Not Working or Not Registering",
  "keyboard_not_working_intro": "If keys don’t register:",
  "keyboard_not_working_1": "Connection issues: replug USB; for wireless, check battery and reconnect.",
  "keyboard_not_working_2": "Driver problems: update keyboard drivers (Windows Device Manager / Mac System Preferences).",
  "keyboard_not_working_3": "Test on another computer: if it works elsewhere, issue is software; if not, hardware failure.",
  "keyboard_not_working_4": "Check for physical damage: broken switches or loose connections.",
  "keyboard_not_working_5": "Software conflicts: close remapping/macro tools that may block input.",
  "keyboard_ghosting_title": "Keyboard Ghosting",
  "keyboard_ghosting_intro": "Ghosting occurs when multiple simultaneous presses fail to register, common on non-NKRO keyboards:",
  "keyboard_ghosting_1": "Cause: matrix design without N-key rollover; cheaper boards lack NKRO/6KRO.",
  "keyboard_ghosting_2": "How to test: press combos (e.g., WASD + Shift + Space); missing keys indicate ghosting.",
  "keyboard_ghosting_3": "Solutions: upgrade to NKRO/6KRO (mechanical boards often support NKRO via USB/PS2).",
  "keyboard_ghosting_4": "Gaming impact: ghosting hurts gamers needing multiple simultaneous presses; test common combos.",
  "keyboard_wrong_title": "Wrong Characters Appearing",
  "keyboard_wrong_intro": "If a key outputs the wrong character:",
  "keyboard_wrong_1": "Check keyboard layout (QWERTY/AZERTY/QWERTZ).",
  "keyboard_wrong_2": "Verify OS language/region settings.",
  "keyboard_wrong_3": "Check stuck modifiers (Shift/Alt/Ctrl).",
  "keyboard_wrong_4": "Restart to reset keyboard state.",
  "keyboard_wrong_5": "Use on-screen keyboard to isolate software vs hardware.",
  "keyboard_types_title": "Understanding Keyboard Types",
  "keyboard_mech_title": "Mechanical Keyboards",
  "keyboard_mech_intro": "Mechanical keyboards use individual switches, offering:",
  "keyboard_mech_1": "Better tactile feedback and feel",
  "keyboard_mech_2": "Longer lifespan (50-100M keystrokes)",
  "keyboard_mech_3": "Often support N-key rollover (NKRO)",
  "keyboard_mech_4": "Customizable keycaps and switches",
  "keyboard_mech_5": "Generally more expensive",
  "keyboard_mem_title": "Membrane Keyboards",
  "keyboard_mem_intro": "Membrane keyboards use rubber domes, offering:",
  "keyboard_mem_1": "Quieter operation",
  "keyboard_mem_2": "Lower cost",
  "keyboard_mem_3": "Thinner profile",
  "keyboard_mem_4": "May have ghosting with multiple key presses",
  "keyboard_mem_5": "Shorter lifespan vs mechanical",
  "keyboard_laptop_title": "Laptop Keyboards",
  "keyboard_laptop_intro": "Laptop keyboards are integrated and compact:",
  "keyboard_laptop_1": "Compact with function key combos",
  "keyboard_laptop_2": "Limited key travel",
  "keyboard_laptop_3": "Hard to repair/replace individual keys",
  "keyboard_laptop_4": "Layout variations (Enter size, arrows, etc.)",
  "keyboard_maint_title": "Keyboard Maintenance Tips",
  "keyboard_maint_1": "Regular cleaning: compressed air monthly to remove dust/debris",
  "keyboard_maint_2": "Avoid eating over keyboard: crumbs/spills cause failures",
  "keyboard_maint_3": "Clean keycaps: remove (if possible), wash, dry fully before reattaching",
  "keyboard_maint_4": "Update drivers: keep keyboard drivers current",
  "keyboard_maint_5": "Protect from spills: use covers or keep drinks away",
  "keyboard_maint_6": "Test regularly: run keyboard test monthly to catch issues early",
  "keyboard_troubleshooting_title": "Troubleshooting Guides",
  "keyboard_tips_gaming_title": "Testing for Gaming",
  "keyboard_tips_gaming_intro": "Gamers need reliable multi-key input. When testing for gaming:",
  "keyboard_tips_gaming_1": "Test common gaming combos (WASD + Shift + Space + Ctrl)",
  "keyboard_tips_gaming_2": "Verify all movement keys",
  "keyboard_tips_gaming_3": "Check modifiers used in games",
  "keyboard_tips_gaming_4": "Test for ghosting with simultaneous presses",
  "keyboard_tips_gaming_5": "Ensure fast registration without delay",
  "keyboard_tips_gaming_6": "Consider anti-ghosting or NKRO boards for competitive play",
  "keyboard_ready_text": "Ready to test your keyboard?",
  "keyboard_ready_link": "Scroll up and click \"Run Keyboard Test\"",
  "keyboard_faq_1_q": "How do I test my keyboard online?",
  "keyboard_faq_1_a": "Press any key; tested keys light up. Progress shows which keys you’ve checked.",
  "keyboard_faq_2_q": "What is keyboard ghosting?",
  "keyboard_faq_2_a": "Ghosting is missed keys when pressing multiple keys. It happens on non-NKRO keyboards; test combos to confirm.",
  "keyboard_faq_3_q": "How do I fix stuck keys?",
  "keyboard_faq_3_a": "Clean debris, remove keycaps carefully, dry after spills, or replace switches/keyboard if needed.",
  "keyboard_faq_4_q": "Why are some keys not working?",
  "keyboard_faq_4_a": "Could be damage, debris, drivers, or hardware failure. Clean, update drivers, and test on another computer.",
  "keyboard_faq_5_q": "Can I test laptop keyboards?",
  "keyboard_faq_5_a": "Yes. Works for laptop, mechanical, membrane, and wireless keyboards—just press keys to test."
}



