{
  "site_name": "DeviceCheck.io",
  "site_tagline": "मुफ्त ऑनलाइन डिवाइस परीक्षण उपकरण",
  "home_title": "DeviceCheck.io - मुफ्त ऑनलाइन डिवाइस परीक्षण उपकरण",
  "home_description": "हमारे मुफ्त ऑनलाइन डिवाइस परीक्षण उपकरणों के साथ अपने वेबकैम, माइक्रोफोन, कीबोर्ड, स्क्रीन और अधिक का परीक्षण करें। Zoom, Teams और Google Meet के लिए तत्काल ब्राउज़र-आधारित निदान।",
  "breadcrumb_home": "होम",
  "breadcrumb_guides": "गाइड",
  "breadcrumb_issues": "समस्याएं",
  "run_test": "परीक्षण चलाएं",
  "run_microphone_test": "माइक्रोफोन परीक्षण चलाएं",
  "run_webcam_test": "वेबकैम परीक्षण चलाएं",
  "run_keyboard_test": "कीबोर्ड परीक्षण चलाएं",
  "run_screen_test": "स्क्रीन परीक्षण चलाएं",
  "mic_test_title": "ऑनलाइन माइक्रोफोन परीक्षण – मुफ्त माइक परीक्षण उपकरण",
  "mic_test_description": "अपने माइक्रोफोन का तुरंत ऑनलाइन परीक्षण करें। हमारे मुफ्त ब्राउज़र-आधारित माइक्रोफोन परीक्षण के साथ माइक इनपुट स्तर, ऑडियो गुणवत्ता और रिकॉर्ड प्लेबैक जांचें। Zoom, Teams और Google Meet के लिए बिल्कुल सही।",
  "webcam_test_title": "ऑनलाइन वेबकैम परीक्षण – तत्काल ब्राउज़र डिवाइस जांच",
  "keyboard_test_title": "ऑनलाइन कीबोर्ड परीक्षण – मुफ्त कीबोर्ड परीक्षण उपकरण",
  "screen_test_title": "ऑनलाइन स्क्रीन परीक्षण – डेड पिक्सेल और रंग परीक्षण",
  "meeting_check_title": "मीटिंग चेक – वीडियो कॉल तैयारी उपकरण",
  "guides_title": "डिवाइस परीक्षण गाइड और ट्यूटोरियल",
  "issues_title": "समस्या निवारण गाइड और समाधान",
  "frequently_asked_questions": "अक्सर पूछे जाने वाले प्रश्न",
  "related_tools": "संबंधित उपकरण",
  "related_guides": "संबंधित गाइड",
  "device_navigation": "डिवाइस नेविगेशन",
  "microphone_test": "माइक्रोफोन परीक्षण",
  "webcam_test": "वेबकैम परीक्षण",
  "keyboard_test": "कीबोर्ड परीक्षण",
  "screen_test": "स्क्रीन परीक्षण",
  "meeting_check": "मीटिंग चेक",
  "privacy": "गोपनीयता",
  "terms": "नियम",
  "contact": "संपर्क",
  "language": "भाषा",
  "english": "English",
  "spanish": "Español",
  "portuguese": "Português",
  "german": "Deutsch",
  "french": "Français",
  "hindi": "हिन्दी",
  "mic_intro": "हमारे मुफ्त ऑनलाइन उपकरण के साथ अपने माइक्रोफोन का तुरंत परीक्षण करें। इनपुट स्तर जांचें, ऑडियो गुणवत्ता सत्यापित करें, और महत्वपूर्ण वीडियो कॉल या रिकॉर्डिंग से पहले सुनिश्चित करें कि आपका माइक पूरी तरह से काम कर रहा है।",
  "mic_how_to_title": "ऑनलाइन अपने माइक्रोफोन का परीक्षण कैसे करें",
  "mic_how_to_intro": "वीडियो कॉल, पॉडकास्ट रिकॉर्डिंग, या लाइव स्ट्रीम से पहले अपने माइक्रोफोन का परीक्षण करना पेशेवर ऑडियो गुणवत्ता के लिए महत्वपूर्ण है। हमारा मुफ्त ऑनलाइन माइक्रोफोन परीक्षण आपके माइक की कार्यक्षमता, इनपुट स्तर और ऑडियो स्पष्टता पर तत्काल प्रतिक्रिया प्रदान करता है - सभी सॉफ़्टवेयर स्थापित किए बिना या खाते बनाए बिना।",
  "mic_why_test_title": "अपने माइक्रोफोन का परीक्षण क्यों करें?",
  "mic_why_test_intro": "माइक्रोफोन की समस्याएं महत्वपूर्ण कॉल और रिकॉर्डिंग को बर्बाद कर सकती हैं। पहले से परीक्षण करके, आप कर सकते हैं:",
  "mic_why_test_1": "सत्यापित करें कि आपका माइक्रोफोन पता लगाया गया है और काम कर रहा है",
  "mic_why_test_2": "इनपुट वॉल्यूम स्तर जांचें और आवश्यकता होने पर समायोजित करें",
  "mic_why_test_3": "ऑडियो गुणवत्ता और स्पष्टता का परीक्षण करें",
  "mic_why_test_4": "सुनिश्चित करें कि ब्राउज़र अनुमतियां सही ढंग से कॉन्फ़िगर की गई हैं",
  "mic_why_test_5": "महत्वपूर्ण कॉल से पहले हार्डवेयर समस्याओं की पहचान करें",
  "mic_why_test_6": "पूर्ण ऑडियो सेटअप के लिए स्पीकर/हेडसेट आउटपुट का परीक्षण करें",
  "mic_steps_title": "माइक्रोफोन परीक्षण के लिए चरण-दर-चरण गाइड",
  "mic_common_problems_title": "सामान्य माइक्रोफोन समस्याएं और समाधान",
  "mic_not_working_title": "माइक्रोफोन काम नहीं कर रहा या कोई आवाज़ नहीं",
  "mic_not_working_intro": "यदि आपका माइक्रोफोन कोई गतिविधि नहीं दिखाता:",
  "mic_too_quiet_title": "माइक्रोफोन बहुत शांत या कम वॉल्यूम",
  "mic_too_quiet_intro": "यदि वॉल्यूम मीटर कम गतिविधि दिखाता है:",
  "mic_echo_title": "इको, फीडबैक, या विकृति",
  "mic_echo_intro": "ऑडियो गुणवत्ता समस्याएं इसके कारण हो सकती हैं:",
  "mic_wrong_device_title": "गलत माइक्रोफोन चयनित",
  "mic_wrong_device_intro": "यदि गलत माइक्रोफोन उपयोग किया जा रहा है:",
  "mic_video_conferencing_title": "वीडियो कॉन्फ्रेंसिंग के लिए माइक्रोफोन परीक्षण",
  "mic_tips_title": "बेहतर ऑडियो गुणवत्ता के लिए सुझाव",
  "mic_tips_1": "हेडफ़ोन का उपयोग करें: स्पीकर ऑडियो को अपने माइक्रोफोन से दूर रखकर इको और फीडबैक को रोकता है",
  "mic_tips_2": "अपने माइक को स्थिति दें: इष्टतम स्पष्टता के लिए माइक्रोफोन को अपने मुंह से 15-30 सेमी दूर रखें",
  "mic_tips_3": "पृष्ठभूमि शोर कम करें: खिड़कियां बंद करें, पंखे बंद करें, और परिवेशी ध्वनियों को कम करें",
  "mic_tips_4": "स्पष्ट रूप से बोलें: स्पष्ट उच्चारण करें और एक स्थिर वॉल्यूम पर बोलें",
  "mic_tips_5": "महत्वपूर्ण कॉल से पहले परीक्षण करें: महत्वपूर्ण बैठकों या रिकॉर्डिंग से पहले हमेशा अपने माइक्रोफोन का परीक्षण करें",
  "mic_tips_6": "अपने वातावरण की जांच करें: नरम फर्नीचर इको कम करता है; कठोर सतहें रिवर्बरेशन बनाती हैं",
  "mic_ready_text": "अपने माइक्रोफोन का परीक्षण करने के लिए तैयार हैं?",
  "mic_scroll_up_text": "ऊपर स्क्रॉल करें और \"माइक्रोफोन परीक्षण चलाएं\" पर क्लिक करें",
  "mic_scroll_up_link": "ऊपर स्क्रॉल करें और \"माइक्रोफोन परीक्षण चलाएं\" पर क्लिक करें",
  "test_another_device": "दूसरे डिवाइस का परीक्षण करें",
  "mic_step_1_title": "माइक्रोफ़ोन अनुमतियाँ दें",
  "mic_step_1_text": "जब आप हमारी माइक्रोफोन टेस्ट पेज पर आते हैं, आपका ब्राउज़र माइक्रोफोन एक्सेस मांगेगा। जारी रखने के लिए \"अनुमति दें\" पर क्लिक करें। यदि संकेत नहीं दिखता, तो एड्रेस बार में माइक्रोफोन आइकन देखें।",
  "mic_step_2_title": "वॉल्यूम मीटर जांचें",
  "mic_step_2_text": "अनुमति मिलने के बाद माइक्रोफोन में बोलें। वॉल्यूम मीटर हरा, पीला या लाल बार दिखाएगा। हरा/पीला आदर्श है; लाल का मतलब बहुत तेज़ है।",
  "mic_step_3_title": "एक टेस्ट क्लिप रिकॉर्ड करें",
  "mic_step_3_text": "\"माइक्रोफोन\" बटन दबाकर 5 सेकंड की रिकॉर्डिंग करें। \"टेस्टिंग 1, 2, 3\" बोलें या गिनें। रिकॉर्डिंग 5 सेकंड बाद खुद रुक जाएगी।",
  "mic_step_4_title": "अपनी रिकॉर्डिंग सुनें",
  "mic_step_4_text": "रिकॉर्डिंग के बाद प्ले दबाकर सुनें। इससे प्रतिध्वनि, विकृति, बैकग्राउंड शोर या कम वॉल्यूम जैसी समस्याएँ पता चलती हैं।",
  "mic_step_5_title": "अपने स्पीकर जांचें",
  "mic_step_5_text": "स्पीकर टेस्ट बटन (बायां, दायां, स्वीप) से पुष्टि करें कि आउटपुट डिवाइस सही काम कर रहा है और स्टीरियो के लिए सेट है।",
  "mic_not_working_1": "ब्राउज़र अनुमति जांचें: एड्रेस बार में ताले के आइकन पर क्लिक करें और \"Microphone\" को \"Allow\" पर सेट करें। Chrome: Settings → Privacy and Security → Site Settings → Microphone।",
  "mic_not_working_2": "भौतिक म्यूट स्विच देखें: कई हेडसेट/लैपटॉप में म्यूट बटन होते हैं। सुनिश्चित करें आपका माइक म्यूट नहीं है।",
  "mic_not_working_3": "इनपुट डिवाइस जांचें: Windows: Settings → System → Sound → Input; सही माइक चुनें। Mac: System Preferences → Sound → Input।",
  "mic_not_working_4": "अन्य ऐप बंद करें: एक समय में सिर्फ एक ऐप माइक ले सकता है। Zoom, Teams, Discord आदि बंद करें और पेज रीफ्रेश करें।",
  "mic_not_working_5": "सिस्टम वॉल्यूम जांचें: सुनिश्चित करें माइक म्यूट नहीं है और इनपुट वॉल्यूम पर्याप्त है।",
  "mic_too_quiet_1": "सिस्टम सेटिंग में माइक इनपुट वॉल्यूम बढ़ाएं (Windows: Settings → Sound → Input; Mac: System Preferences → Sound → Input)",
  "mic_too_quiet_2": "यदि उपलब्ध हो तो माइक्रोफोन बूस्ट सक्षम करें (Windows Sound Settings)",
  "mic_too_quiet_3": "माइक के पास जाएँ या स्थिति समायोजित करें",
  "mic_too_quiet_4": "जांचें कि आपके माइक में गेन कंट्रोल डायल/स्विच है या नहीं",
  "mic_too_quiet_5": "हार्डवेयर समस्या को ख़ारिज करने के लिए दूसरा माइक आज़माएँ",
  "mic_echo_1": "स्पीकर फीडबैक: स्पीकर वॉल्यूम कम करें या हेडफ़ोन लगाएँ ताकि माइक स्पीकर आउटपुट न उठाए",
  "mic_echo_2": "कक्ष ध्वनिकी: गूंज कम करने के लिए नरम फर्नीचर, गलीचे या पर्दे जोड़ें",
  "mic_echo_3": "माइक की स्थिति: माइक को स्पीकर से दूर रखें और मुंह से समान दूरी बनाए रखें",
  "mic_echo_4": "बैकग्राउंड शोर: खिड़कियां बंद करें, पंखे बंद करें, शोर स्रोत कम करें",
  "mic_echo_5": "ड्राइवर समस्याएँ: ऑडियो ड्राइवर अपडेट करें (Windows Device Manager या Mac System Preferences)",
  "mic_wrong_device_1": "सिस्टम साउंड सेटिंग में देखें कौन सा इनपुट सक्रिय है",
  "mic_wrong_device_2": "USB माइक्रोफोन हटाकर फिर लगाएँ",
  "mic_wrong_device_3": "Windows: स्पीकर आइकन पर राइट-क्लिक → Sound Settings खोलें → इनपुट डिवाइस चुनें",
  "mic_wrong_device_4": "Mac: System Preferences → Sound → Input, सही डिवाइस चुनें",
  "mic_wrong_device_5": "कुछ ब्राउज़र इनपुट डिवाइस चुनने देते हैं—ब्राउज़र सेटिंग देखें",
  "mic_zoom_title": "Zoom माइक्रोफोन परीक्षण",
  "mic_zoom_text": "Zoom मीटिंग में शामिल होने से पहले यहाँ परीक्षण करें। यदि यह काम करता है, तो Zoom में भी माइक काम करेगा। Zoom: Settings → Audio → Test Speaker & Microphone; हमारा ब्राउज़र परीक्षण तेज है और ऐप नहीं चाहिए।",
  "mic_teams_title": "Microsoft Teams माइक परीक्षण",
  "mic_teams_text": "Teams उपयोगकर्ताओं को मीटिंग से पहले यहाँ परीक्षण करना चाहिए। Teams: Settings → Devices → Audio Devices; हमारा ऑनलाइन परीक्षण किसी भी ब्राउज़र में बिना इंस्टॉल किए चलता है।",
  "mic_meet_title": "Google Meet माइक्रोफोन जांच",
  "mic_meet_text": "Google Meet ब्राउज़र माइक्रोफोन एक्सेस उपयोग करता है। यदि हमारा परीक्षण काम करता है, Meet भी करेगा। आप Meet में टेस्ट मीटिंग जॉइन करके ऑडियो सेटिंग भी जांच सकते हैं।",
  "mic_levels_title": "माइक्रोफोन इनपुट स्तर समझें",
  "mic_levels_intro": "वॉल्यूम मीटर आपके माइक्रोफोन का इनपुट स्तर दिखाता है:",
  "mic_levels_green": "हरा बार: आदर्श इनपुट। आवाज़ साफ और अच्छे वॉल्यूम पर।",
  "mic_levels_yellow": "पीला बार: अच्छा स्तर, अधिकतम के करीब। अधिकतर मामलों में ठीक।",
  "mic_levels_red": "लाल बार: बहुत तेज़—क्लिपिंग/विकृति। वॉल्यूम कम करें या माइक दूर रखें।",
  "mic_levels_none": "कोई गतिविधि नहीं: माइक नहीं मिला, म्यूट है या वॉल्यूम बहुत कम है। अनुमतियाँ/सेटिंग जांचें।",
  "mic_permissions_title": "ब्राउज़र माइक्रोफोन अनुमतियों की गाइड",
  "mic_permissions_intro": "हर ब्राउज़र माइक्रोफोन अनुमतियाँ थोड़ा अलग संभालता है:",
  "mic_permissions_chrome": "Chrome: एड्रेस बार में ताला → Site Settings → Microphone → Allow. या chrome://settings/content/microphone",
  "mic_permissions_firefox": "Firefox: एड्रेस बार में माइक्रोफोन आइकन → Allow. या Preferences → Privacy & Security → Permissions → Microphone",
  "mic_permissions_edge": "Edge: Chrome जैसा. ताला आइकन → Permissions → Microphone → Allow",
  "mic_permissions_safari": "Safari: Safari → Preferences → Websites → Microphone → इस साइट के लिए Allow",
  "mic_privacy_title": "गोपनीयता और सुरक्षा",
  "mic_privacy_intro": "आपकी ऑडियो गोपनीयता महत्वपूर्ण है। हमारा माइक्रोफोन परीक्षण:",
  "mic_privacy_1": "सभी ऑडियो डेटा को ब्राउज़र में स्थानीय रूप से प्रोसेस करता है",
  "mic_privacy_2": "ऑडियो हमारे सर्वरों को नहीं भेजता",
  "mic_privacy_3": "आपकी आवाज़ को स्टोर या रिकॉर्ड नहीं करता",
  "mic_privacy_4": "डेटा तृतीय पक्षों के साथ साझा नहीं करता",
  "mic_privacy_5": "पेज बंद करते ही माइक्रोफोन एक्सेस रोक देता है",
  "mic_privacy_footer": "सारा ऑडियो प्रोसेसिंग आपके डिवाइस पर रीयल-टाइम में होती है। रिकॉर्डिंग अस्थायी रूप से ब्राउज़र मेमोरी में रहती हैं और पेज रिफ्रेश/बंद करने पर हट जाती हैं।",
  "mic_troubleshooting_title": "समस्या निवारण गाइड",
  "webcam_meta_title": "Online Webcam Test – Instant Camera Check",
  "webcam_meta_description": "Test your webcam online instantly. Check camera resolution, frame rate, lighting, and framing with our free browser-based webcam test. Perfect for Zoom, Teams, and Google Meet.",
  "webcam_intro": "Test your webcam instantly with our free online tool. Check resolution, frame rate, lighting, and perfect your framing before important video calls on Zoom, Teams, or Google Meet.",
  "webcam_how_title": "How to Test Your Webcam Online",
  "webcam_how_intro": "Testing your webcam before an important video call or recording is essential. Our free online webcam test provides instant feedback on your camera's functionality, resolution, and quality—all without installing any software.",
  "webcam_why_title": "Why Test Your Webcam Online?",
  "webcam_why_intro": "Many users discover camera issues only when joining a video call. By testing beforehand, you can:",
  "webcam_why_1": "Verify your camera is detected and working correctly",
  "webcam_why_2": "Check your camera's resolution and frame rate",
  "webcam_why_3": "Ensure proper lighting and framing",
  "webcam_why_4": "Test camera permissions in your browser",
  "webcam_why_5": "Identify hardware or driver issues early",
  "webcam_steps_title": "Step-by-Step Guide: Testing Your Webcam",
  "webcam_step_1_title": "Grant Camera Permissions",
  "webcam_step_1_text": "When you first visit our webcam test page, your browser will prompt you to allow camera access. Click \"Allow\" to proceed. If you don't see a prompt, check your browser's address bar for a camera icon and click it to enable permissions.",
  "webcam_step_2_title": "View Your Live Feed",
  "webcam_step_2_text": "Once permissions are granted, your webcam feed will appear instantly in the preview window. You should see yourself in real-time.",
  "webcam_step_3_title": "Check Resolution",
  "webcam_step_3_text": "Look at the resolution badge displayed on the page. Common resolutions include 720p, 1080p, or 4K. Higher resolutions provide better quality but require more bandwidth.",
  "webcam_step_4_title": "Use Grid Overlay",
  "webcam_step_4_text": "Enable the rule-of-thirds grid and position your eyes along the top horizontal line for professional framing.",
  "webcam_step_5_title": "Toggle Mirror Mode",
  "webcam_step_5_text": "Use the mirror toggle to see yourself mirrored or unmirrored. Choose what feels most natural.",
  "webcam_common_title": "Common Webcam Issues and Solutions",
  "webcam_black_title": "Webcam Not Working or Showing Black Screen",
  "webcam_black_intro": "A black screen is one of the most common webcam issues. Troubleshoot by:",
  "webcam_black_1": "Check browser permissions (lock icon) and set Camera to Allow",
  "webcam_black_2": "Close other applications using the camera (Zoom, Teams, Skype)",
  "webcam_black_3": "Open any physical privacy cover on the camera",
  "webcam_black_4": "Restart the browser completely",
  "webcam_black_5": "Check system camera settings (Windows Privacy → Camera; Mac Security & Privacy → Camera)",
  "webcam_detect_title": "Webcam Not Detected",
  "webcam_detect_intro": "If your browser doesn't detect your webcam:",
  "webcam_detect_1": "Check USB connections for external webcams",
  "webcam_detect_2": "Unplug and replug USB webcams",
  "webcam_detect_3": "Update camera drivers (Windows Device Manager or Mac System Preferences)",
  "webcam_detect_4": "Test in another browser (Chrome, Firefox, Edge, Safari)",
  "webcam_detect_5": "Verify the camera works in another app (Camera app)",
  "webcam_quality_title": "Poor Video Quality or Low Resolution",
  "webcam_quality_intro": "If your webcam quality seems low:",
  "webcam_quality_1": "Clean the camera lens with a microfiber cloth",
  "webcam_quality_2": "Improve lighting—light source in front of you, not behind",
  "webcam_quality_3": "Check if higher resolutions are available in settings",
  "webcam_quality_4": "Avoid virtual cameras/filters that reduce quality",
  "webcam_quality_5": "Update camera drivers for better performance",
  "webcam_video_conf_title": "Testing Webcam for Video Conferencing Platforms",
  "webcam_zoom_title": "Zoom Webcam Test",
  "webcam_zoom_text": "Test your webcam here before joining Zoom. If it works here, it will work in Zoom. In Zoom, go to Settings → Video to see a preview; our browser test is faster and requires no app.",
  "webcam_teams_title": "Microsoft Teams Camera Test",
  "webcam_teams_text": "Teams users can test here before meetings. In Teams: Settings → Devices → Camera. Our online test works in any browser without installing Teams.",
  "webcam_meet_title": "Google Meet Camera Check",
  "webcam_meet_text": "Google Meet relies on browser camera access. If our test works, Meet will too. You can also join a test meeting and check your video preview before others join.",
  "webcam_resolution_title": "Understanding Webcam Resolution",
  "webcam_resolution_intro": "Webcam resolution determines clarity and detail:",
  "webcam_resolution_1": "480p (640x480): Basic quality; can look pixelated",
  "webcam_resolution_2": "720p HD (1280x720): Standard for built-in laptop cameras; good for calls",
  "webcam_resolution_3": "1080p Full HD (1920x1080): Common in external webcams; great for professional calls and recordings",
  "webcam_resolution_4": "4K UHD (3840x2160): Premium webcams; needs more bandwidth/processing",
  "webcam_privacy_title": "Privacy and Security",
  "webcam_privacy_intro": "Your privacy is our priority. Our webcam test:",
  "webcam_privacy_1": "Processes all video locally in your browser",
  "webcam_privacy_2": "Does not record or store video",
  "webcam_privacy_3": "Does not send video to our servers",
  "webcam_privacy_4": "Does not share your feed with third parties",
  "webcam_privacy_footer": "Everything happens in real-time on your device. Once you close the page, camera access stops immediately.",
  "webcam_browser_title": "Browser Compatibility",
  "webcam_browser_intro": "Works on all modern browsers that support MediaDevices:",
  "webcam_browser_1": "Google Chrome: Full support, recommended",
  "webcam_browser_2": "Mozilla Firefox: Full support",
  "webcam_browser_3": "Microsoft Edge: Full support",
  "webcam_browser_4": "Apple Safari: Full support on macOS and iOS",
  "webcam_browser_5": "Opera: Full support",
  "webcam_troubleshooting_title": "Troubleshooting Guides",
  "webcam_tips_title": "Tips for Better Video Calls",
  "webcam_tips_1": "Lighting: place your main light in front of you, not behind",
  "webcam_tips_2": "Camera Height: raise the webcam to eye level for a flattering angle",
  "webcam_tips_3": "Background: keep it clean and uncluttered",
  "webcam_tips_4": "Eye Contact: look at the camera lens when speaking",
  "webcam_tips_5": "Frame Yourself: use the grid to center and keep eyes on the top third",
  "webcam_ready_text": "Ready to test your webcam?",
  "webcam_ready_link": "Scroll up and click \"Run Webcam Test\"",
  "webcam_faq_1_q": "How do I test my webcam online?",
  "webcam_faq_1_a": "Click \"Allow\" when prompted for camera access. Your feed appears instantly with resolution detection and optional grid overlay.",
  "webcam_faq_2_q": "Why is my webcam showing a black screen?",
  "webcam_faq_2_a": "Usually permissions, another app using the camera, or a privacy cover. Allow camera, close other apps, and open the cover.",
  "webcam_faq_3_q": "Can I test my webcam for Zoom or Teams?",
  "webcam_faq_3_a": "Yes. If it works here, it works in Zoom, Teams, Meet, and other platforms.",
  "webcam_faq_4_q": "What webcam resolution should I use?",
  "webcam_faq_4_a": "720p is enough for most calls. Use 1080p or 4K for higher quality if bandwidth allows.",
  "webcam_faq_5_q": "Is my webcam data secure?",
  "webcam_faq_5_a": "All video stays in your browser. We do not send, store, or share your camera feed.",
  "keyboard_meta_title": "Online Keyboard Test – Free Key Tester",
  "keyboard_meta_description": "Test your keyboard online instantly. Check all keys, detect stuck keys, test ghosting, and verify functionality with our free browser-based keyboard test.",
  "keyboard_intro": "Test your keyboard instantly with our free online tool. Check if all keys work properly, detect stuck or non-responsive keys, test for ghosting, and verify your keyboard functionality.",
  "keyboard_how_title": "How to Test Your Keyboard Online",
  "keyboard_how_intro": "Testing your keyboard is essential for ensuring all keys work correctly, especially before important work or gaming sessions. Our free online keyboard test provides instant visual feedback on every key press—all without installing software.",
  "keyboard_why_title": "Why Test Your Keyboard?",
  "keyboard_why_intro": "Keyboard issues can disrupt productivity and gaming. By testing, you can:",
  "keyboard_why_1": "Verify all keys register correctly",
  "keyboard_why_2": "Identify stuck or sticky keys",
  "keyboard_why_3": "Test for keyboard ghosting (multiple key presses)",
  "keyboard_why_4": "Check modifier keys (Shift, Ctrl, Alt) functionality",
  "keyboard_why_5": "Verify special keys (Function keys, arrow keys, etc.)",
  "keyboard_why_6": "Test before important work or gaming",
  "keyboard_steps_title": "Step-by-Step Keyboard Testing Guide",
  "keyboard_step_1_title": "Start Testing",
  "keyboard_step_1_text": "Click \"Run Keyboard Test\" or start pressing keys. Each key lights green when pressed and blue after being tested.",
  "keyboard_step_2_title": "Test All Keys",
  "keyboard_step_2_text": "Press every key including letters, numbers, symbols, function keys, and modifiers (Shift, Ctrl, Alt, etc.).",
  "keyboard_step_3_title": "Check Progress",
  "keyboard_step_3_text": "Watch the progress bar to see how many keys you’ve tested. Aim to test all keys on your keyboard.",
  "keyboard_step_4_title": "Test Multiple Keys",
  "keyboard_step_4_text": "Press multiple keys simultaneously to test for ghosting. Missing registrations indicate ghosting issues.",
  "keyboard_step_5_title": "Review Results",
  "keyboard_step_5_text": "Check recent key presses. If a key doesn’t appear, it may be faulty.",
  "keyboard_common_title": "Common Keyboard Problems and Solutions",
  "keyboard_stuck_title": "Stuck Keys or Keys That Don't Release",
  "keyboard_stuck_intro": "If a key stays pressed or doesn’t release:",
  "keyboard_stuck_1": "Physical debris: use compressed air to clear crumbs/dust/liquid.",
  "keyboard_stuck_2": "Liquid spills: unplug, invert, dry 24-48h; remove keycaps for cleaning if possible.",
  "keyboard_stuck_3": "Keycap removal: gently remove and clean underneath; avoid damaging mechanism.",
  "keyboard_stuck_4": "Mechanical issues: switches may be damaged; replace switch or keyboard if multiple keys affected.",
  "keyboard_not_working_title": "Keys Not Working or Not Registering",
  "keyboard_not_working_intro": "If keys don’t register:",
  "keyboard_not_working_1": "Connection issues: replug USB; for wireless, check battery and reconnect.",
  "keyboard_not_working_2": "Driver problems: update keyboard drivers (Windows Device Manager / Mac System Preferences).",
  "keyboard_not_working_3": "Test on another computer: if it works elsewhere, issue is software; if not, hardware failure.",
  "keyboard_not_working_4": "Check for physical damage: broken switches or loose connections.",
  "keyboard_not_working_5": "Software conflicts: close remapping/macro tools that may block input.",
  "keyboard_ghosting_title": "Keyboard Ghosting",
  "keyboard_ghosting_intro": "Ghosting occurs when multiple simultaneous presses fail to register, common on non-NKRO keyboards:",
  "keyboard_ghosting_1": "Cause: matrix design without N-key rollover; cheaper boards lack NKRO/6KRO.",
  "keyboard_ghosting_2": "How to test: press combos (e.g., WASD + Shift + Space); missing keys indicate ghosting.",
  "keyboard_ghosting_3": "Solutions: upgrade to NKRO/6KRO (mechanical boards often support NKRO via USB/PS2).",
  "keyboard_ghosting_4": "Gaming impact: ghosting hurts gamers needing multiple simultaneous presses; test common combos.",
  "keyboard_wrong_title": "Wrong Characters Appearing",
  "keyboard_wrong_intro": "If a key outputs the wrong character:",
  "keyboard_wrong_1": "Check keyboard layout (QWERTY/AZERTY/QWERTZ).",
  "keyboard_wrong_2": "Verify OS language/region settings.",
  "keyboard_wrong_3": "Check stuck modifiers (Shift/Alt/Ctrl).",
  "keyboard_wrong_4": "Restart to reset keyboard state.",
  "keyboard_wrong_5": "Use on-screen keyboard to isolate software vs hardware.",
  "keyboard_types_title": "Understanding Keyboard Types",
  "keyboard_mech_title": "Mechanical Keyboards",
  "keyboard_mech_intro": "Mechanical keyboards use individual switches, offering:",
  "keyboard_mech_1": "Better tactile feedback and feel",
  "keyboard_mech_2": "Longer lifespan (50-100M keystrokes)",
  "keyboard_mech_3": "Often support N-key rollover (NKRO)",
  "keyboard_mech_4": "Customizable keycaps and switches",
  "keyboard_mech_5": "Generally more expensive",
  "keyboard_mem_title": "Membrane Keyboards",
  "keyboard_mem_intro": "Membrane keyboards use rubber domes, offering:",
  "keyboard_mem_1": "Quieter operation",
  "keyboard_mem_2": "Lower cost",
  "keyboard_mem_3": "Thinner profile",
  "keyboard_mem_4": "May have ghosting with multiple key presses",
  "keyboard_mem_5": "Shorter lifespan vs mechanical",
  "keyboard_laptop_title": "Laptop Keyboards",
  "keyboard_laptop_intro": "Laptop keyboards are integrated and compact:",
  "keyboard_laptop_1": "Compact with function key combos",
  "keyboard_laptop_2": "Limited key travel",
  "keyboard_laptop_3": "Hard to repair/replace individual keys",
  "keyboard_laptop_4": "Layout variations (Enter size, arrows, etc.)",
  "keyboard_maint_title": "Keyboard Maintenance Tips",
  "keyboard_maint_1": "Regular cleaning: compressed air monthly to remove dust/debris",
  "keyboard_maint_2": "Avoid eating over keyboard: crumbs/spills cause failures",
  "keyboard_maint_3": "Clean keycaps: remove (if possible), wash, dry fully before reattaching",
  "keyboard_maint_4": "Update drivers: keep keyboard drivers current",
  "keyboard_maint_5": "Protect from spills: use covers or keep drinks away",
  "keyboard_maint_6": "Test regularly: run keyboard test monthly to catch issues early",
  "keyboard_troubleshooting_title": "Troubleshooting Guides",
  "keyboard_tips_gaming_title": "Testing for Gaming",
  "keyboard_tips_gaming_intro": "Gamers need reliable multi-key input. When testing for gaming:",
  "keyboard_tips_gaming_1": "Test common gaming combos (WASD + Shift + Space + Ctrl)",
  "keyboard_tips_gaming_2": "Verify all movement keys",
  "keyboard_tips_gaming_3": "Check modifiers used in games",
  "keyboard_tips_gaming_4": "Test for ghosting with simultaneous presses",
  "keyboard_tips_gaming_5": "Ensure fast registration without delay",
  "keyboard_tips_gaming_6": "Consider anti-ghosting or NKRO boards for competitive play",
  "keyboard_ready_text": "Ready to test your keyboard?",
  "keyboard_ready_link": "Scroll up and click \"Run Keyboard Test\"",
  "keyboard_faq_1_q": "How do I test my keyboard online?",
  "keyboard_faq_1_a": "Press any key; tested keys light up. Progress shows which keys you’ve checked.",
  "keyboard_faq_2_q": "What is keyboard ghosting?",
  "keyboard_faq_2_a": "Ghosting is missed keys when pressing multiple keys. It happens on non-NKRO keyboards; test combos to confirm.",
  "keyboard_faq_3_q": "How do I fix stuck keys?",
  "keyboard_faq_3_a": "Clean debris, remove keycaps carefully, dry after spills, or replace switches/keyboard if needed.",
  "keyboard_faq_4_q": "Why are some keys not working?",
  "keyboard_faq_4_a": "Could be damage, debris, drivers, or hardware failure. Clean, update drivers, and test on another computer.",
  "keyboard_faq_5_q": "Can I test laptop keyboards?",
  "keyboard_faq_5_a": "Yes. Works for laptop, mechanical, membrane, and wireless keyboards—just press keys to test."
}



