{
  "site_name": "DeviceCheck.io",
  "site_tagline": "Ferramentas Gratuitas de Teste de Dispositivos Online",
  "home_title": "DeviceCheck.io - Ferramentas Gratuitas de Teste de Dispositivos Online",
  "home_description": "Teste sua webcam, microfone, teclado, tela e muito mais com nossas ferramentas gratuitas de teste de dispositivos online. Diagnósticos instantâneos baseados em navegador para Zoom, Teams e Google Meet.",
  "breadcrumb_home": "Início",
  "breadcrumb_guides": "Guias",
  "breadcrumb_issues": "Problemas",
  "run_test": "Executar Teste",
  "run_microphone_test": "Executar Teste de Microfone",
  "run_webcam_test": "Executar Teste de Webcam",
  "run_keyboard_test": "Executar Teste de Teclado",
  "run_screen_test": "Executar Teste de Tela",
  "mic_test_title": "Teste de Microfone Online – Ferramenta Gratuita de Teste de Microfone",
  "mic_test_description": "Teste seu microfone online instantaneamente. Verifique os níveis de entrada do microfone, qualidade do áudio e reproduza gravações com nosso teste gratuito de microfone baseado em navegador. Perfeito para Zoom, Teams e Google Meet.",
  "webcam_test_title": "Teste de Webcam Online – Verificação Instantânea de Dispositivo",
  "keyboard_test_title": "Teste de Teclado Online – Ferramenta Gratuita de Teste de Teclado",
  "screen_test_title": "Teste de Tela Online – Teste de Pixels Mortos e Cor",
  "meeting_check_title": "Verificação de Reunião – Ferramenta de Preparação para Vide chamadas",
  "guides_title": "Guias e Tutoriais de Teste de Dispositivos",
  "issues_title": "Guias de Solução de Problemas e Correções",
  "frequently_asked_questions": "Perguntas Frequentes",
  "related_tools": "Ferramentas Relacionadas",
  "related_guides": "Guias Relacionados",
  "device_navigation": "Navegação de Dispositivos",
  "microphone_test": "Teste de Microfone",
  "webcam_test": "Teste de Webcam",
  "keyboard_test": "Teste de Teclado",
  "screen_test": "Teste de Tela",
  "meeting_check": "Verificação de Reunião",
  "privacy": "Privacidade",
  "terms": "Termos",
  "contact": "Contato",
  "language": "Idioma",
  "english": "English",
  "spanish": "Español",
  "portuguese": "Português",
  "german": "Deutsch",
  "french": "Français",
  "hindi": "हिन्दी",
  "mic_intro": "Teste seu microfone instantaneamente com nossa ferramenta gratuita online. Verifique os níveis de entrada, confira a qualidade do áudio e garanta que seu microfone funcione perfeitamente antes de vide chamadas ou gravações importantes.",
  "mic_how_to_title": "Como Testar Seu Microfone Online",
  "mic_how_to_intro": "Testar seu microfone antes de uma vide chamada, gravação de podcast ou transmissão ao vivo é crucial para qualidade de áudio profissional. Nosso teste gratuito de microfone online fornece feedback instantâneo sobre a funcionalidade do seu microfone, níveis de entrada e clareza de áudio, tudo sem instalar software ou criar contas.",
  "mic_why_test_title": "Por Que Testar Seu Microfone?",
  "mic_why_test_intro": "Problemas com o microfone podem arruinar chamadas e gravações importantes. Ao testar antecipadamente, você pode:",
  "mic_why_test_1": "Verificar se seu microfone é detectado e está funcionando",
  "mic_why_test_2": "Verificar os níveis de volume de entrada e ajustar se necessário",
  "mic_why_test_3": "Testar a qualidade e clareza do áudio",
  "mic_why_test_4": "Garantir que as permissões do navegador estejam configuradas corretamente",
  "mic_why_test_5": "Identificar problemas de hardware antes de chamadas importantes",
  "mic_why_test_6": "Testar a saída de alto-falantes/fones de ouvido para configuração de áudio completa",
  "mic_steps_title": "Guia Passo a Passo para Testar o Microfone",
  "mic_common_problems_title": "Problemas Comuns do Microfone e Soluções",
  "mic_not_working_title": "Microfone Não Funciona ou Sem Som",
  "mic_not_working_intro": "Se seu microfone não mostra atividade:",
  "mic_too_quiet_title": "Microfone Muito Baixo ou Volume Baixo",
  "mic_too_quiet_intro": "Se o medidor de volume mostra pouca atividade:",
  "mic_echo_title": "Eco, Feedback ou Distorção",
  "mic_echo_intro": "Problemas de qualidade de áudio podem ser causados por:",
  "mic_wrong_device_title": "Microfone Incorreto Selecionado",
  "mic_wrong_device_intro": "Se o microfone incorreto estiver sendo usado:",
  "mic_video_conferencing_title": "Testar o Microfone para Videoconferências",
  "mic_tips_title": "Dicas para Melhor Qualidade de Áudio",
  "mic_tips_1": "Use Fones de Ouvido: Previne eco e feedback mantendo o áudio dos alto-falantes fora do seu microfone",
  "mic_tips_2": "Posicione Seu Microfone: Mantenha o microfone a 15-30 cm da sua boca para clareza ótima",
  "mic_tips_3": "Reduza o Ruído de Fundo: Feche janelas, desligue ventiladores e minimize sons ambientes",
  "mic_tips_4": "Fale Claramente: Articule e fale em um volume consistente",
  "mic_tips_5": "Teste Antes de Chamadas Importantes: Sempre teste seu microfone antes de reuniões ou gravações importantes",
  "mic_tips_6": "Verifique Seu Ambiente: Móveis macios reduzem o eco; superfícies duras criam reverberação",
  "mic_ready_text": "Pronto para testar seu microfone?",
  "mic_scroll_up_text": "Role para cima e clique em \"Executar Teste de Microfone\"",
  "mic_scroll_up_link": "Role para cima e clique em \"Executar Teste de Microfone\"",
  "test_another_device": "Testar Outro Dispositivo",
  "mic_step_1_title": "Conceder Permissões de Microfone",
  "mic_step_1_text": "Quando você visitar nossa página de teste de microfone, seu navegador pedirá acesso ao microfone. Clique em \"Permitir\" para continuar. Se você não vir uma solicitação, procure um ícone de microfone na barra de endereços do seu navegador.",
  "mic_step_2_title": "Verificar o Medidor de Volume",
  "mic_step_2_text": "Uma vez que as permissões sejam concedidas, fale no seu microfone. Você deve ver o medidor de volume responder com barras verdes, amarelas ou vermelhas indicando seu nível de entrada. Verde/amarelo é ideal; vermelho significa que você está muito alto.",
  "mic_step_3_title": "Gravar um Clip de Teste",
  "mic_step_3_text": "Clique no botão do microfone para gravar um teste de 5 segundos. Diga \"Testando 1, 2, 3\" ou conte em voz alta. A gravação parará automaticamente após 5 segundos.",
  "mic_step_4_title": "Reproduzir Sua Gravação",
  "mic_step_4_text": "Após gravar, clique em reproduzir para ouvir como você soa. Isso ajuda a identificar problemas como eco, distorção, ruído de fundo ou volume baixo.",
  "mic_step_5_title": "Testar Seus Alto-falantes",
  "mic_step_5_text": "Use os botões de teste de alto-falantes (Esquerdo, Direito, Varredura) para verificar se seu dispositivo de saída funciona corretamente e está configurado para áudio estéreo.",
  "mic_not_working_1": "Verificar Permissões do Navegador: Clique no ícone de cadeado na barra de endereços do seu navegador e certifique-se de que \"Microfone\" está definido como \"Permitir\". No Chrome, vá para Configurações → Privacidade e Segurança → Configurações do Site → Microfone.",
  "mic_not_working_2": "Verificar Interruptor de Mudo Físico: Muitos fones de ouvido e laptops têm botões ou interruptores de mudo físicos. Certifique-se de que seu microfone não esteja fisicamente silenciado.",
  "mic_not_working_3": "Verificar Dispositivo de Entrada: No Windows, vá para Configurações → Sistema → Som → Entrada e certifique-se de que o microfone correto está selecionado. No Mac, vá para Preferências do Sistema → Som → Entrada.",
  "mic_not_working_4": "Fechar Outras Aplicações: Apenas um aplicativo pode acessar seu microfone por vez. Feche Zoom, Teams, Discord ou outros aplicativos que usem o microfone, depois atualize esta página.",
  "mic_not_working_5": "Verificar Volume do Sistema: Certifique-se de que seu microfone não esteja silenciado nas configurações do sistema e que o volume de entrada esteja aumentado.",
  "mic_too_quiet_1": "Aumentar o volume de entrada do microfone nas configurações do sistema (Windows: Configurações → Som → Entrada; Mac: Preferências do Sistema → Som → Entrada)",
  "mic_too_quiet_2": "Habilitar o aumento do microfone se disponível (Configurações de Som do Windows)",
  "mic_too_quiet_3": "Aproxime-se mais do microfone ou ajuste o posicionamento",
  "mic_too_quiet_4": "Verifique se seu microfone tem um dial ou interruptor de controle de ganho",
  "mic_too_quiet_5": "Teste com um microfone diferente para descartar problemas de hardware",
  "mic_echo_1": "Retroalimentação de Alto-falantes: Diminua o volume dos alto-falantes ou use fones de ouvido para evitar que o microfone capture a saída dos alto-falantes",
  "mic_echo_2": "Acústica da Sala: Reduza o eco adicionando móveis macios, tapetes ou cortinas à sua sala",
  "mic_echo_3": "Posição do Microfone: Mantenha o microfone longe dos alto-falantes e a uma distância consistente da sua boca",
  "mic_echo_4": "Ruído de Fundo: Feche janelas, desligue ventiladores e minimize fontes de ruído de fundo",
  "mic_echo_5": "Problemas de Drivers: Atualize seus drivers de áudio (Gerenciador de Dispositivos do Windows ou Preferências do Sistema do Mac)",
  "mic_wrong_device_1": "Verifique as configurações de som do sistema para ver qual dispositivo de entrada está ativo",
  "mic_wrong_device_2": "Desconecte e reconecte microfones USB",
  "mic_wrong_device_3": "No Windows, clique com o botão direito no ícone do alto-falante → Abrir Configurações de Som → Escolha seu dispositivo de entrada",
  "mic_wrong_device_4": "No Mac, vá para Preferências do Sistema → Som → Entrada e selecione o dispositivo correto",
  "mic_wrong_device_5": "Alguns navegadores permitem que você escolha o dispositivo de entrada—verifique as configurações do navegador",
  "mic_zoom_title": "Teste de Microfone do Zoom",
  "mic_zoom_text": "Antes de entrar em uma reunião do Zoom, teste seu microfone aqui primeiro. Se nossa ferramenta funcionar, seu microfone funcionará no Zoom. Você também pode testar no Zoom indo para Configurações → Áudio → Testar Alto-falante e Microfone, mas nosso teste do navegador é mais rápido e não requer o aplicativo Zoom.",
  "mic_teams_title": "Teste de Microfone do Microsoft Teams",
  "mic_teams_text": "Os usuários do Teams devem testar seu microfone aqui antes de entrar em reuniões. No Teams, você pode testar indo para Configurações → Dispositivos → Dispositivos de Áudio, mas nosso teste online funciona em qualquer navegador sem instalar o Teams.",
  "mic_meet_title": "Verificação de Microfone do Google Meet",
  "mic_meet_text": "O Google Meet usa o acesso ao microfone do seu navegador. Se nosso teste funcionar, o Meet também funcionará. Você também pode testar no Meet entrando em uma reunião de teste e verificando suas configurações de áudio antes que outros entrem.",
  "mic_levels_title": "Entender os Níveis de Entrada do Microfone",
  "mic_levels_intro": "O medidor de volume mostra o nível de entrada do seu microfone:",
  "mic_levels_green": "Barras Verdes: Nível de entrada ótimo. Sua voz está clara e em um bom volume.",
  "mic_levels_yellow": "Barras Amarelas: Bom nível, mas se aproximando do máximo. Ainda aceitável para a maioria dos casos de uso.",
  "mic_levels_red": "Barras Vermelhas: Muito alto—você está cortando ou distorcendo. Diminua o volume de entrada ou afaste-se mais do microfone.",
  "mic_levels_none": "Sem Atividade: Microfone não detectado, silenciado ou volume muito baixo. Verifique permissões e configurações.",
  "mic_permissions_title": "Guia de Permissões de Microfone do Navegador",
  "mic_permissions_intro": "Cada navegador lida com as permissões do microfone de forma ligeiramente diferente:",
  "mic_permissions_chrome": "Chrome: Clique no ícone de cadeado na barra de endereços → Configurações do Site → Microfone → Permitir. Ou vá para chrome://settings/content/microphone",
  "mic_permissions_firefox": "Firefox: Clique no ícone do microfone na barra de endereços → Permitir. Ou vá para Preferências → Privacidade e Segurança → Permissões → Microfone",
  "mic_permissions_edge": "Edge: Similar ao Chrome. Clique no ícone de cadeado → Permissões → Microfone → Permitir",
  "mic_permissions_safari": "Safari: Safari → Preferências → Sites → Microfone → Permitir para este site",
  "mic_privacy_title": "Privacidade e Segurança",
  "mic_privacy_intro": "Sua privacidade de áudio é fundamental. Nosso teste de microfone:",
  "mic_privacy_1": "Processa todos os dados de áudio localmente no seu navegador",
  "mic_privacy_2": "Não envia áudio para nossos servidores",
  "mic_privacy_3": "Não armazena ou grava sua voz",
  "mic_privacy_4": "Não compartilha dados com terceiros",
  "mic_privacy_5": "Interrompe o acesso ao microfone quando você fecha a página",
  "mic_privacy_footer": "Todo o processamento de áudio acontece em tempo real no seu dispositivo. As gravações são armazenadas temporariamente na memória do seu navegador e são excluídas quando você atualiza ou fecha a página.",
  "mic_troubleshooting_title": "Guias de Solução de Problemas",
  "mic_faq_1_q": "Como testar meu microfone online?",
  "mic_faq_1_a": "Clique em \"Permitir\" quando solicitado o acesso ao microfone. Fale no seu microfone e observe o medidor de volume responder. Você pode gravar um clip de teste de 5 segundos e reproduzi-lo para verificar a qualidade do áudio.",
  "mic_faq_2_q": "Por que meu microfone não está funcionando?",
  "mic_faq_2_a": "Causas comuns incluem permissões do navegador negadas, interruptores de mudo físicos, dispositivo de entrada errado selecionado ou problemas de drivers. Verifique primeiro as permissões do navegador, depois confirme as configurações do sistema e certifique-se de que nenhum outro aplicativo esteja usando o microfone.",
  "mic_faq_3_q": "Posso testar meu microfone para Zoom ou Teams?",
  "mic_faq_3_a": "Sim! Se nosso teste de microfone funcionar, seu microfone funcionará no Zoom, Microsoft Teams, Google Meet e outras plataformas de videoconferência. Teste aqui primeiro para evitar problemas durante chamadas importantes.",
  "mic_faq_4_q": "Meus dados de microfone estão seguros?",
  "mic_faq_4_a": "Absolutamente. Todo o processamento de áudio acontece localmente no seu navegador. Nenhum dado de áudio é enviado para nossos servidores, gravado, armazenado ou compartilhado com ninguém. Sua privacidade está completamente protegida.",
  "mic_faq_5_q": "O que o medidor de volume deve mostrar?",
  "mic_faq_5_a": "O medidor deve mostrar barras verdes ou amarelas quando você fala normalmente. Se permanecer vermelho ou não mostrar atividade, verifique as configurações de volume do seu microfone, certifique-se de que não está mudo e confirme que o dispositivo de entrada correto está selecionado.",
  "webcam_meta_title": "Teste de Webcam Online – Verificação Instantânea de Câmera",
  "webcam_meta_description": "Teste sua webcam online instantaneamente. Verifique a resolução da câmera, taxa de quadros, iluminação e enquadramento com nosso teste gratuito de webcam baseado em navegador. Perfeito para Zoom, Teams e Google Meet.",
  "webcam_intro": "Teste sua webcam instantaneamente com nossa ferramenta gratuita online. Verifique a resolução, taxa de quadros, iluminação e aperfeiçoe seu enquadramento antes de vide chamadas importantes no Zoom, Teams ou Google Meet.",
  "webcam_how_title": "Como Testar Sua Webcam Online",
  "webcam_how_intro": "Testar sua webcam antes de uma vide chamada ou gravação importante é essencial. Nosso teste gratuito de webcam online fornece feedback instantâneo sobre a funcionalidade, resolução e qualidade da sua câmera, tudo sem instalar software.",
  "webcam_why_title": "Por Que Testar Sua Webcam Online?",
  "webcam_why_intro": "Muitos usuários descobrem problemas com a câmera apenas ao entrar em uma vide chamada. Ao testar antecipadamente, você pode:",
  "webcam_why_1": "Verificar se sua câmera é detectada e está funcionando corretamente",
  "webcam_why_2": "Verificar a resolução e taxa de quadros da sua câmera",
  "webcam_why_3": "Garantir iluminação e enquadramento adequados",
  "webcam_why_4": "Testar permissões da câmera no seu navegador",
  "webcam_why_5": "Identificar problemas de hardware ou drivers cedo",
  "webcam_steps_title": "Guia Passo a Passo: Testando Sua Webcam",
  "webcam_step_1_title": "Conceder Permissões da Câmera",
  "webcam_step_1_text": "Quando você visitar nossa página de teste de webcam pela primeira vez, seu navegador solicitará permissão para acessar a câmera. Clique em \"Permitir\" para continuar. Se você não vir uma solicitação, procure um ícone de câmera na barra de endereços do seu navegador e clique para habilitar as permissões.",
  "webcam_step_2_title": "Ver Sua Transmissão ao Vivo",
  "webcam_step_2_text": "Uma vez que as permissões sejam concedidas, a transmissão da sua webcam aparecerá instantaneamente na janela de visualização. Você deve se ver em tempo real.",
  "webcam_step_3_title": "Verificar Resolução",
  "webcam_step_3_text": "Observe a etiqueta de resolução exibida na página. Resoluções comuns incluem 720p, 1080p ou 4K. Resoluções mais altas fornecem melhor qualidade, mas exigem mais largura de banda.",
  "webcam_step_4_title": "Usar Sobreposição de Grade",
  "webcam_step_4_text": "Habilite a grade de regra dos terços e posicione seus olhos ao longo da linha horizontal superior para um enquadramento profissional.",
  "webcam_step_5_title": "Alternar Modo Espelho",
  "webcam_step_5_text": "Use o botão de espelho para se ver refletido ou não refletido. Escolha o que parecer mais natural.",
  "webcam_common_title": "Problemas Comuns de Webcam e Soluções",
  "webcam_black_title": "Webcam Não Funciona ou Mostra Tela Preta",
  "webcam_black_intro": "Uma tela preta é um dos problemas mais comuns de webcam. Solucione verificando:",
  "webcam_black_1": "Verifique as permissões do navegador (ícone de cadeado) e defina Câmera como Permitir",
  "webcam_black_2": "Feche outras aplicações que estejam usando a câmera (Zoom, Teams, Skype)",
  "webcam_black_3": "Abra qualquer cobertura física de privacidade na câmera",
  "webcam_black_4": "Reinicie o navegador completamente",
  "webcam_black_5": "Verifique as configurações de câmera do sistema (Windows Privacidade → Câmera; Mac Segurança e Privacidade → Câmera)",
  "webcam_detect_title": "Webcam Não Detectada",
  "webcam_detect_intro": "Se seu navegador não detectar sua webcam:",
  "webcam_detect_1": "Verifique as conexões USB para webcams externas",
  "webcam_detect_2": "Desconecte e reconecte webcams USB",
  "webcam_detect_3": "Atualize os drivers da câmera (Gerenciador de Dispositivos do Windows ou Preferências do Sistema do Mac)",
  "webcam_detect_4": "Teste em outro navegador (Chrome, Firefox, Edge, Safari)",
  "webcam_detect_5": "Verifique se a câmera funciona em outro aplicativo (aplicativo Câmera)",
  "webcam_quality_title": "Qualidade de Vídeo Baixa ou Resolução Baixa",
  "webcam_quality_intro": "Se a qualidade da sua webcam parecer baixa:",
  "webcam_quality_1": "Limpe a lente da câmera com um pano de microfibra",
  "webcam_quality_2": "Melhore a iluminação: fonte de luz na sua frente, não atrás",
  "webcam_quality_3": "Verifique se há resoluções mais altas disponíveis nas configurações",
  "webcam_quality_4": "Evite câmeras virtuais ou filtros que reduzam a qualidade",
  "webcam_quality_5": "Atualize os drivers da câmera para melhor desempenho",
  "webcam_video_conf_title": "Testando Webcam para Plataformas de Videoconferência",
  "webcam_zoom_title": "Teste de Webcam do Zoom",
  "webcam_zoom_text": "Teste sua webcam aqui antes de entrar no Zoom. Se funcionar aqui, funcionará no Zoom. No Zoom, vá para Configurações → Vídeo para ver uma visualização; nosso teste do navegador é mais rápido e não requer aplicativo.",
  "webcam_teams_title": "Teste de Câmera do Microsoft Teams",
  "webcam_teams_text": "Usuários do Teams podem testar aqui antes das reuniões. No Teams: Configurações → Dispositivos → Câmera. Nosso teste online funciona em qualquer navegador sem instalar o Teams.",
  "webcam_meet_title": "Verificação de Câmera do Google Meet",
  "webcam_meet_text": "O Google Meet depende do acesso à câmera do navegador. Se nosso teste funcionar, o Meet também funcionará. Você também pode entrar em uma reunião de teste e verificar sua visualização de vídeo antes que outros entrem.",
  "webcam_resolution_title": "Entendendo a Resolução da Webcam",
  "webcam_resolution_intro": "A resolução da webcam determina a clareza e o detalhe:",
  "webcam_resolution_1": "480p (640x480): Qualidade básica; pode parecer pixelada",
  "webcam_resolution_2": "720p HD (1280x720): Padrão para câmeras integradas de laptops; boa para chamadas",
  "webcam_resolution_3": "1080p Full HD (1920x1080): Comum em webcams externas; excelente para chamadas profissionais e gravações",
  "webcam_resolution_4": "4K UHD (3840x2160): Webcams premium; precisa de mais largura de banda e processamento",
  "webcam_privacy_title": "Privacidade e Segurança",
  "webcam_privacy_intro": "Sua privacidade é nossa prioridade. Nosso teste de webcam:",
  "webcam_privacy_1": "Processa todo o vídeo localmente no seu navegador",
  "webcam_privacy_2": "Não grava nem armazena vídeo",
  "webcam_privacy_3": "Não envia vídeo para nossos servidores",
  "webcam_privacy_4": "Não compartilha sua transmissão com terceiros",
  "webcam_privacy_footer": "Tudo acontece em tempo real no seu dispositivo. Assim que você fechar a página, o acesso à câmera para imediatamente.",
  "webcam_browser_title": "Compatibilidade do Navegador",
  "webcam_browser_intro": "Funciona em todos os navegadores modernos que suportam MediaDevices:",
  "webcam_browser_1": "Google Chrome: Suporte completo, recomendado",
  "webcam_browser_2": "Mozilla Firefox: Suporte completo",
  "webcam_browser_3": "Microsoft Edge: Suporte completo",
  "webcam_browser_4": "Apple Safari: Suporte completo no macOS e iOS",
  "webcam_browser_5": "Opera: Suporte completo",
  "webcam_troubleshooting_title": "Guias de Solução de Problemas",
  "webcam_tips_title": "Dicas para Melhores Vide Chamadas",
  "webcam_tips_1": "Iluminação: coloque sua luz principal na sua frente, não atrás",
  "webcam_tips_2": "Altura da Câmera: eleve a webcam até a altura dos olhos para um ângulo favorecedor",
  "webcam_tips_3": "Fundo: mantenha limpo e organizado",
  "webcam_tips_4": "Contato Visual: olhe para a lente da câmera ao falar",
  "webcam_tips_5": "Enquadre-se: use a grade para centralizar e manter os olhos no terço superior",
  "webcam_ready_text": "Pronto para testar sua webcam?",
  "webcam_ready_link": "Role para cima e clique em \"Executar Teste de Webcam\"",
  "webcam_faq_1_q": "Como testar minha webcam online?",
  "webcam_faq_1_a": "Clique em \"Permitir\" quando solicitado o acesso à câmera. Sua transmissão aparece instantaneamente com detecção de resolução e sobreposição de grade opcional.",
  "webcam_faq_2_q": "Por que minha webcam está mostrando uma tela preta?",
  "webcam_faq_2_a": "Geralmente são permissões, outro aplicativo usando a câmera ou uma cobertura de privacidade. Permita a câmera, feche outros aplicativos e abra a cobertura.",
  "webcam_faq_3_q": "Posso testar minha webcam para Zoom ou Teams?",
  "webcam_faq_3_a": "Sim. Se funcionar aqui, funcionará no Zoom, Teams, Meet e outras plataformas.",
  "webcam_faq_4_q": "Qual resolução de webcam devo usar?",
  "webcam_faq_4_a": "720p é suficiente para a maioria das chamadas. Use 1080p ou 4K para maior qualidade se a largura de banda permitir.",
  "webcam_faq_5_q": "Meus dados de webcam estão seguros?",
  "webcam_faq_5_a": "Todo o vídeo permanece no seu navegador. Não enviamos, armazenamos nem compartilhamos sua transmissão de câmera.",
  "keyboard_meta_title": "Online Keyboard Test – Free Key Tester",
  "keyboard_meta_description": "Test your keyboard online instantly. Check all keys, detect stuck keys, test ghosting, and verify functionality with our free browser-based keyboard test.",
  "keyboard_intro": "Test your keyboard instantly with our free online tool. Check if all keys work properly, detect stuck or non-responsive keys, test for ghosting, and verify your keyboard functionality.",
  "keyboard_how_title": "How to Test Your Keyboard Online",
  "keyboard_how_intro": "Testing your keyboard is essential for ensuring all keys work correctly, especially before important work or gaming sessions. Our free online keyboard test provides instant visual feedback on every key press—all without installing software.",
  "keyboard_why_title": "Why Test Your Keyboard?",
  "keyboard_why_intro": "Keyboard issues can disrupt productivity and gaming. By testing, you can:",
  "keyboard_why_1": "Verify all keys register correctly",
  "keyboard_why_2": "Identify stuck or sticky keys",
  "keyboard_why_3": "Test for keyboard ghosting (multiple key presses)",
  "keyboard_why_4": "Check modifier keys (Shift, Ctrl, Alt) functionality",
  "keyboard_why_5": "Verify special keys (Function keys, arrow keys, etc.)",
  "keyboard_why_6": "Test before important work or gaming",
  "keyboard_steps_title": "Step-by-Step Keyboard Testing Guide",
  "keyboard_step_1_title": "Start Testing",
  "keyboard_step_1_text": "Click \"Run Keyboard Test\" or start pressing keys. Each key lights green when pressed and blue after being tested.",
  "keyboard_step_2_title": "Test All Keys",
  "keyboard_step_2_text": "Press every key including letters, numbers, symbols, function keys, and modifiers (Shift, Ctrl, Alt, etc.).",
  "keyboard_step_3_title": "Check Progress",
  "keyboard_step_3_text": "Watch the progress bar to see how many keys you’ve tested. Aim to test all keys on your keyboard.",
  "keyboard_step_4_title": "Test Multiple Keys",
  "keyboard_step_4_text": "Press multiple keys simultaneously to test for ghosting. Missing registrations indicate ghosting issues.",
  "keyboard_step_5_title": "Review Results",
  "keyboard_step_5_text": "Check recent key presses. If a key doesn’t appear, it may be faulty.",
  "keyboard_common_title": "Common Keyboard Problems and Solutions",
  "keyboard_stuck_title": "Stuck Keys or Keys That Don't Release",
  "keyboard_stuck_intro": "If a key stays pressed or doesn’t release:",
  "keyboard_stuck_1": "Physical debris: use compressed air to clear crumbs/dust/liquid.",
  "keyboard_stuck_2": "Liquid spills: unplug, invert, dry 24-48h; remove keycaps for cleaning if possible.",
  "keyboard_stuck_3": "Keycap removal: gently remove and clean underneath; avoid damaging mechanism.",
  "keyboard_stuck_4": "Mechanical issues: switches may be damaged; replace switch or keyboard if multiple keys affected.",
  "keyboard_not_working_title": "Keys Not Working or Not Registering",
  "keyboard_not_working_intro": "If keys don’t register:",
  "keyboard_not_working_1": "Connection issues: replug USB; for wireless, check battery and reconnect.",
  "keyboard_not_working_2": "Driver problems: update keyboard drivers (Windows Device Manager / Mac System Preferences).",
  "keyboard_not_working_3": "Test on another computer: if it works elsewhere, issue is software; if not, hardware failure.",
  "keyboard_not_working_4": "Check for physical damage: broken switches or loose connections.",
  "keyboard_not_working_5": "Software conflicts: close remapping/macro tools that may block input.",
  "keyboard_ghosting_title": "Keyboard Ghosting",
  "keyboard_ghosting_intro": "Ghosting occurs when multiple simultaneous presses fail to register, common on non-NKRO keyboards:",
  "keyboard_ghosting_1": "Cause: matrix design without N-key rollover; cheaper boards lack NKRO/6KRO.",
  "keyboard_ghosting_2": "How to test: press combos (e.g., WASD + Shift + Space); missing keys indicate ghosting.",
  "keyboard_ghosting_3": "Solutions: upgrade to NKRO/6KRO (mechanical boards often support NKRO via USB/PS2).",
  "keyboard_ghosting_4": "Gaming impact: ghosting hurts gamers needing multiple simultaneous presses; test common combos.",
  "keyboard_wrong_title": "Wrong Characters Appearing",
  "keyboard_wrong_intro": "If a key outputs the wrong character:",
  "keyboard_wrong_1": "Check keyboard layout (QWERTY/AZERTY/QWERTZ).",
  "keyboard_wrong_2": "Verify OS language/region settings.",
  "keyboard_wrong_3": "Check stuck modifiers (Shift/Alt/Ctrl).",
  "keyboard_wrong_4": "Restart to reset keyboard state.",
  "keyboard_wrong_5": "Use on-screen keyboard to isolate software vs hardware.",
  "keyboard_types_title": "Understanding Keyboard Types",
  "keyboard_mech_title": "Mechanical Keyboards",
  "keyboard_mech_intro": "Mechanical keyboards use individual switches, offering:",
  "keyboard_mech_1": "Better tactile feedback and feel",
  "keyboard_mech_2": "Longer lifespan (50-100M keystrokes)",
  "keyboard_mech_3": "Often support N-key rollover (NKRO)",
  "keyboard_mech_4": "Customizable keycaps and switches",
  "keyboard_mech_5": "Generally more expensive",
  "keyboard_mem_title": "Membrane Keyboards",
  "keyboard_mem_intro": "Membrane keyboards use rubber domes, offering:",
  "keyboard_mem_1": "Quieter operation",
  "keyboard_mem_2": "Lower cost",
  "keyboard_mem_3": "Thinner profile",
  "keyboard_mem_4": "May have ghosting with multiple presses",
  "keyboard_mem_5": "Shorter lifespan vs mechanical",
  "keyboard_laptop_title": "Laptop Keyboards",
  "keyboard_laptop_intro": "Laptop keyboards are integrated and compact:",
  "keyboard_laptop_1": "Compact with function key combos",
  "keyboard_laptop_2": "Limited key travel",
  "keyboard_laptop_3": "Hard to repair/replace individual keys",
  "keyboard_laptop_4": "Layout variations (Enter size, arrows, etc.)",
  "keyboard_maint_title": "Keyboard Maintenance Tips",
  "keyboard_maint_1": "Regular cleaning: compressed air monthly to remove dust/debris",
  "keyboard_maint_2": "Avoid eating over keyboard: crumbs/spills cause failures",
  "keyboard_maint_3": "Clean keycaps: remove (if possible), wash, dry fully before reattaching",
  "keyboard_maint_4": "Update drivers: keep keyboard drivers current",
  "keyboard_maint_5": "Protect from spills: use covers or keep drinks away",
  "keyboard_maint_6": "Test regularly: run keyboard test monthly to catch issues early",
  "keyboard_troubleshooting_title": "Troubleshooting Guides",
  "keyboard_tips_gaming_title": "Testing for Gaming",
  "keyboard_tips_gaming_intro": "Gamers need reliable multi-key input. When testing for gaming:",
  "keyboard_tips_gaming_1": "Test common gaming combos (WASD + Shift + Space + Ctrl)",
  "keyboard_tips_gaming_2": "Verify all movement keys",
  "keyboard_tips_gaming_3": "Check modifiers used in games",
  "keyboard_tips_gaming_4": "Test for ghosting with simultaneous presses",
  "keyboard_tips_gaming_5": "Ensure fast registration without delay",
  "keyboard_tips_gaming_6": "Consider anti-ghosting or NKRO boards for competitive play",
  "keyboard_ready_text": "Ready to test your keyboard?",
  "keyboard_ready_link": "Scroll up and click \"Run Keyboard Test\"",
  "keyboard_faq_1_q": "How do I test my keyboard online?",
  "keyboard_faq_1_a": "Press any key; tested keys light up. Progress shows which keys you’ve checked.",
  "keyboard_faq_2_q": "What is keyboard ghosting?",
  "keyboard_faq_2_a": "Ghosting is missed keys when pressing multiple keys. It happens on non-NKRO keyboards; test combos to confirm.",
  "keyboard_faq_3_q": "How do I fix stuck keys?",
  "keyboard_faq_3_a": "Clean debris, remove keycaps carefully, dry after spills, or replace switches/keyboard if needed.",
  "keyboard_faq_4_q": "Why are some keys not working?",
  "keyboard_faq_4_a": "Could be damage, debris, drivers, or hardware failure. Clean, update drivers, and test on another computer.",
  "keyboard_faq_5_q": "Can I test laptop keyboards?",
  "keyboard_faq_5_a": "Yes. Works for laptop, mechanical, membrane, and wireless keyboards—just press keys to test."
}



